[
  {
    "text": "Not sure why I haven't reviewed this location before! Visited there many times. On of the decent mcds out there in the city. Service is good, food is good, and the environment is good. They're just enough. Nothing more, nothing less. Always busy. A good place to take some food if you're in a rush or just for fun. Enjoy!\nFood: 4/5  |  Service: 4/5  |  Atmosphere: 4/5",
    "category": "collector"
  },
  {
    "text": "Order took longer than usual, and was missing a McChicken the first time.  Had to wait a long time after that to get another one.\n\nPicture shows how beautifully it was made.\n\nI was also given few napkins, and had to ask an employee for more.\n\nThere was a couple of homeless people that wandered in the restaurant that made me leave early.\n\nWould give 0 stars if I could.",
    "category": "social"
  },
  {
    "text": "After ordered, just request for add some hot water in my bottle, and they said I shall pay for it?!, I never heard this request in other Mcdonald or Starbucks! you love money so much like this?? huh??",
    "category": "water"
  },
  {
    "text": "It’s a McDonald’s and it has the typical McDonalds menu. Same motif etc. but this one is special. A couple of homeless people open the door for u without asking for a dime. Very polite people. Not the usual. And this McDonald’s is spotless. I don’t know if they are paid extra but these employees keep this place clean. Cleanest McDonalds I’ve ever been in. The wait time isn’t bad either. I would have given them 4 stars if they offered a vegetarian dish. #sankofatafari #kingofcoffeenyc #mcdonalds #nyc #broadway",
    "category": "social"
  },
  {
    "text": "Worst iced coffee ever we ordered french vanilla but they gave us mocha and its totally like water 🤮 and also worst mc spicey burger ewe 🤮",
    "category": "water"
  },
  {
    "text": "The ladies in the staff are very rude  but all the men staff are very nice and polite. All the porters and generators who are Spanish are polite and helpful too but not the ladies on the cash register or serving orders. You will have to face other problems like baring homeless people and saying no to beggars and unexpected random behaviour from wierd customers they have.\n\nKid-friendliness: Happy meal is a good option",
    "category": "social"
  },
  {
    "text": "They need to update their hours on google. They are not open 24/hrs I walked all the way here from my hotel at 5am waste of time and energy",
    "category": "waste"
  },
  {
    "text": "Overall I liked it, but they are missing some security guards there... not to be mean, disrespect or a bad person; but the homeless people kill the vibe, is not very nice eating with someone who stinks and is asking for money next to you\nFood: 5/5  |  Service: 5/5  |  Atmosphere: 2/5",
    "category": "social"
  },
  {
    "text": "Good dinning experience with comfortable seating and music. Enjoying my chicken selects and fries there. I just wish they got rid of panhandlers and the homeless outside.",
    "category": "social"
  },
  {
    "text": "Terrible service. Every employee was busy dancing, recording, on the phone or whatever, anything but working. Every customer had an incorrect order, no employee seemed to care. The employees are all teenagers who are not interested in working. You need an adult or at least a responsible person working here.\n\nAlso homeless and junkies have taken over the second floor. I felt terrible for the housekeeper who was busy trying to keep this place clean   .\n\nFind another McDonald's. Anything but this location.",
    "category": "social"
  },
  {
    "text": "Too many homeless people inside the place. I understand their situation, but they make the seats soily and dirty, which makes u just buy and go out\nFood: 4/5  |  Service: 3/5  |  Atmosphere: 1/5",
    "category": "social"
  },
  {
    "text": "Not open 24/7 came in at 3am, was told that the registers were not working and to download app. Once app was downloaded I proceeded to order on the app. Then was told that the restaurant was actually closed. Wasted 15-20mins of my time. Could’ve just told me they were closed but wasted my time with the app BS.",
    "category": "waste"
  },
  {
    "text": "I like this place, a lot of hands to serve customers. Super fast and very efficient, clean with 2 levels of spacious space to eat my meal. The only thing I really don’t like is that homeless guy opening door for you. Most customers don’t like that also. They better do something about it. We want a clean and smelling good surroundings.",
    "category": "social"
  },
  {
    "text": "The staff is friendly and food is fresh. The new decor looks nice. Music selection here is amazing though. 4 out of 5 because there was a homeless person sitting at the upper level that was making the place smell. I dont mean to single him out but it was distracting.",
    "category": "social"
  }
]