[
  {
    "text": "Not sure why I haven't reviewed this location before! Visited there many times. On of the decent mcds out there in the city. Service is good, food is good, and the environment is good. They're just enough. Nothing more, nothing less. Always busy. A good place to take some food if you're in a rush or just for fun. Enjoy!\nFood: 4/5  |  Service: 4/5  |  Atmosphere: 4/5",
    "category": "collector"
  },
  {
    "text": "After ordered, just request for add some hot water in my bottle, and they said I shall pay for it?!, I never heard this request in other Mcdonald or Starbucks! you love money so much like this?? huh??",
    "category": "water"
  },
  {
    "text": "Worst iced coffee ever we ordered french vanilla but they gave us mocha and its totally like water 🤮 and also worst mc spicey burger ewe 🤮",
    "category": "water"
  },
  {
    "text": "They need to update their hours on google. They are not open 24/hrs I walked all the way here from my hotel at 5am waste of time and energy",
    "category": "waste"
  },
  {
    "text": "Not open 24/7 came in at 3am, was told that the registers were not working and to download app. Once app was downloaded I proceeded to order on the app. Then was told that the restaurant was actually closed. Wasted 15-20mins of my time. Could’ve just told me they were closed but wasted my time with the app BS.",
    "category": "waste"
  },
  {
    "text": "Gets my order wrong pretty regularly. With the fountain only being available behind the counter, getting refills is a pain. Not that it matters since they've arbitrarily closed off their indoor dining for months now. Whenever I feel like grabbing food in the middle of the night I think about coming here but until indoor dining is open again it's just not a good choice to go.\n\nThe ONLY thing this McDonald's has over other nearby food places is it's \"open\" 24 hours. That doesn't matter, though, because if you ever go at any unusual hour they'll tell you they're closed anyway. In other words, their ONE selling point is just blatantly false advertising.\n\nWhat a waste of prime real estate space that could go towards somewhere that actually serves food.",
    "category": "waste"
  },
  {
    "text": "Horrible. There were tables you could stand at but all the chairs were roped off. Got a cup of what they called coffee but it tasted more like water with cream and sugar. The restaurant was filthy. Didn't bother ordering food because of the dining area being so dirty. Imagine what the kitchen part looks like.",
    "category": "water"
  },
  {
    "text": "Went through the drive thru, got a BURNT burger and then got a kids meal for my kid and they gave her a VAPE? Uh, please explain how this could've happened? Love McDonald's but not this location. Will be speaking to Corporate about this...",
    "category": "adverse"
  },
  {
    "text": "Every time I come in at 4:30 there’s no food being served cash registers off but have customers inside eating, sleeping or just simply sitting down in the dining areas.. and I once had a employee tell me they weren’t open but yet the doors were open people were inside and there were employees working and it says open 24 hour on the sign outside and online.. the false advertising has to stop.. and I will be calling corporate",
    "category": "adverse"
  },
  {
    "text": "Chickens are sentient beings and deserve better treatment than McDonald’s grants them. McDonald’s has failed to meet even the low industry standards set by competitors like Starbucks and Burger King when it comes to caring for chickens. Caring consumers continue to speak up about the blatant cruelty McDonald’s allows in its supply chain, but management obviously doesn't care so I will be boycotting this McDonald’s location and every other until we hear of a commitment to a better policy for chickens!",
    "category": "social"
  },
  {
    "text": "Probably one of the worst McDonald's restaurants to go to at night. Only one cashier operates and a person behind it serves drinks as well. I only spotted one or two people in the kitchen, so you can imagine how long it takes to get your food. If you are out at night and looking for a place to get food quickly - do not come. You will waste your time in a line waiting to order and waiting for your food.",
    "category": "waste"
  },
  {
    "text": "There was alot of customers  waiting long for their food. The little mexican manager was rude he told me that I have to wait  after that asked for my money back. He lucky I was still in my uniform cause the time I wasted waiting for my food was crazy. I ended up going to Subways I was so upset I didnt eat the whole sandwich. If I wasnt in my uniform I would of went back to the store and threw my meatball sandwich at him.",
    "category": "waste"
  },
  {
    "text": "Great burgers, for fast food. Be careful ordering. They only seem to serve meals. Ordered JUST a burger and got unwanted fries too. Also charges deposit on water bottles.",
    "category": "water"
  },
  {
    "text": "RACIST TO THE BONE.\n\nDon't take my word for it, go see for yourself.\n\nThey only hire Hispanics, if you are any other ethnicity they will not hire you.\n\nThey have ZERO white people working there and the only black person who works there cleans the toilets.\n\nThis is nothing new, it's been that way for as long as I can remember.\n\nI'm surprised no complaints have been filled with the Human Rights Commission.",
    "category": "social"
  },
  {
    "text": "This 24 hour dealie peaks right around last call, where you will no doubt encounter the wobbliest people in the the city. I was once asked by a probably-not-even-that-drunk Nigerian if I \"like to dance.... to music.\" Buried in the liminal space betwen 'dance' and 'to music' is everything you need to know about this shack of drunken insanity and their ersatz-eats.\n\nI highly recommend nothing on their menu, but what do you care, you're already wasted. If nothing else you'll walk out of here with your senses molested and 15,000 calories in a greasy bag. (And what the **** is a McDouble?)",
    "category": "waste"
  },
  {
    "text": "Restaurant de la chaîne hyper connue, propose des sandwichs et des salades. Très propres et bien entretenu, il est bondé de monde à cause de sa localisation. Les prix sont cohérents avec ce qui se pratique, les menu signature sont étonnement moins cher qu'en France. J'avais pris un quarter pounder with cheese (en pensant à un film de Tarantino), j'ai été assez déçu contrairement a ma compagne qui s'est régalé de son sandwich signature.",
    "category": "collector"
  },
  {
    "text": "Worst time ever.\nHuge seating area but every afternoon middle school kids make it impossible to sit and have a meal.\nTough environment to be between 3 and 5 pm",
    "category": "collector"
  },
  {
    "text": "Says its open 24hours but you can't place orders after 3am. A complete waste of a trip.",
    "category": "waste"
  },
  {
    "text": "The real kudos should go to the night workers and the night crew for everything they have to deal with from dealing with the homeless drunk patrons and everything else especially when they're constantly understaffed and corporate and everyone else tends to ignore them",
    "category": "adverse"
  },
  {
    "text": "Service was poor. I ordered large Sprite and water and ice was given me. I got home when I found out. Somebody is not doing something right...",
    "category": "water"
  },
  {
    "text": "Ordered 3 McChicken, it was not well cooked and had some cartilage, also the lettuce were brown!!\nJust wasted $14",
    "category": "waste"
  },
  {
    "text": "This location is awful.  It is dirty.  The staff is out of control.  McDonald's corporate should really take a close look at this location.  Extensive training is in need of the staff.",
    "category": "adverse"
  },
  {
    "text": "You guys need to update the location hours. since I went at 5am and u wasn't open. THIS IS NOT A 24HR LOCATION DO NOT WASTE YOUR TIME!!!",
    "category": "waste"
  },
  {
    "text": "Just bought a bottle of water. Took forever and staff was rude",
    "category": "water"
  }
]