[
  {
    "text": "Not sure why I haven't reviewed this location before! Visited there many times. On of the decent mcds out there in the city. Service is good, food is good, and the environment is good. They're just enough. Nothing more, nothing less. Always busy. A good place to take some food if you're in a rush or just for fun. Enjoy!\nFood: 4/5  |  Service: 4/5  |  Atmosphere: 4/5",
    "category": "collector"
  },
  {
    "text": "Order took longer than usual, and was missing a McChicken the first time.  Had to wait a long time after that to get another one.\n\nPicture shows how beautifully it was made.\n\nI was also given few napkins, and had to ask an employee for more.\n\nThere was a couple of homeless people that wandered in the restaurant that made me leave early.\n\nWould give 0 stars if I could.",
    "category": "social"
  },
  {
    "text": "After ordered, just request for add some hot water in my bottle, and they said I shall pay for it?!, I never heard this request in other Mcdonald or Starbucks! you love money so much like this?? huh??",
    "category": "water"
  },
  {
    "text": "It’s a McDonald’s and it has the typical McDonalds menu. Same motif etc. but this one is special. A couple of homeless people open the door for u without asking for a dime. Very polite people. Not the usual. And this McDonald’s is spotless. I don’t know if they are paid extra but these employees keep this place clean. Cleanest McDonalds I’ve ever been in. The wait time isn’t bad either. I would have given them 4 stars if they offered a vegetarian dish. #sankofatafari #kingofcoffeenyc #mcdonalds #nyc #broadway",
    "category": "social"
  },
  {
    "text": "Worst iced coffee ever we ordered french vanilla but they gave us mocha and its totally like water 🤮 and also worst mc spicey burger ewe 🤮",
    "category": "water"
  },
  {
    "text": "The ladies in the staff are very rude  but all the men staff are very nice and polite. All the porters and generators who are Spanish are polite and helpful too but not the ladies on the cash register or serving orders. You will have to face other problems like baring homeless people and saying no to beggars and unexpected random behaviour from wierd customers they have.\n\nKid-friendliness: Happy meal is a good option",
    "category": "social"
  },
  {
    "text": "They need to update their hours on google. They are not open 24/hrs I walked all the way here from my hotel at 5am waste of time and energy",
    "category": "waste"
  },
  {
    "text": "Overall I liked it, but they are missing some security guards there... not to be mean, disrespect or a bad person; but the homeless people kill the vibe, is not very nice eating with someone who stinks and is asking for money next to you\nFood: 5/5  |  Service: 5/5  |  Atmosphere: 2/5",
    "category": "social"
  },
  {
    "text": "Good dinning experience with comfortable seating and music. Enjoying my chicken selects and fries there. I just wish they got rid of panhandlers and the homeless outside.",
    "category": "social"
  },
  {
    "text": "Terrible service. Every employee was busy dancing, recording, on the phone or whatever, anything but working. Every customer had an incorrect order, no employee seemed to care. The employees are all teenagers who are not interested in working. You need an adult or at least a responsible person working here.\n\nAlso homeless and junkies have taken over the second floor. I felt terrible for the housekeeper who was busy trying to keep this place clean   .\n\nFind another McDonald's. Anything but this location.",
    "category": "social"
  },
  {
    "text": "Too many homeless people inside the place. I understand their situation, but they make the seats soily and dirty, which makes u just buy and go out\nFood: 4/5  |  Service: 3/5  |  Atmosphere: 1/5",
    "category": "social"
  },
  {
    "text": "Not open 24/7 came in at 3am, was told that the registers were not working and to download app. Once app was downloaded I proceeded to order on the app. Then was told that the restaurant was actually closed. Wasted 15-20mins of my time. Could’ve just told me they were closed but wasted my time with the app BS.",
    "category": "waste"
  },
  {
    "text": "I like this place, a lot of hands to serve customers. Super fast and very efficient, clean with 2 levels of spacious space to eat my meal. The only thing I really don’t like is that homeless guy opening door for you. Most customers don’t like that also. They better do something about it. We want a clean and smelling good surroundings.",
    "category": "social"
  },
  {
    "text": "The staff is friendly and food is fresh. The new decor looks nice. Music selection here is amazing though. 4 out of 5 because there was a homeless person sitting at the upper level that was making the place smell. I dont mean to single him out but it was distracting.",
    "category": "social"
  },
  {
    "text": "This McDonald's was decently clean however they ran out of apple pies which sucked. There are a couple of homeless people sleeping on the tables which I wasn't too upset with however they did have a funny odor which made it a little difficult 2 eat my food in peace. The staff is pretty good and overall my experience was a pleasant one",
    "category": "social"
  },
  {
    "text": "Gets my order wrong pretty regularly. With the fountain only being available behind the counter, getting refills is a pain. Not that it matters since they've arbitrarily closed off their indoor dining for months now. Whenever I feel like grabbing food in the middle of the night I think about coming here but until indoor dining is open again it's just not a good choice to go.\n\nThe ONLY thing this McDonald's has over other nearby food places is it's \"open\" 24 hours. That doesn't matter, though, because if you ever go at any unusual hour they'll tell you they're closed anyway. In other words, their ONE selling point is just blatantly false advertising.\n\nWhat a waste of prime real estate space that could go towards somewhere that actually serves food.",
    "category": "waste"
  },
  {
    "text": "The location of this Mcdonalds is much needed I can tell you that. Also even with the amount of people there it is fairly clean. The washroom is pretty clean too. One thing that makes me sad is the amount of homeless people in the area. It is not their fault but the city really needs to see what's going on.",
    "category": "social"
  },
  {
    "text": "Horrible. There were tables you could stand at but all the chairs were roped off. Got a cup of what they called coffee but it tasted more like water with cream and sugar. The restaurant was filthy. Didn't bother ordering food because of the dining area being so dirty. Imagine what the kitchen part looks like.",
    "category": "water"
  },
  {
    "text": "Went through the drive thru, got a BURNT burger and then got a kids meal for my kid and they gave her a VAPE? Uh, please explain how this could've happened? Love McDonald's but not this location. Will be speaking to Corporate about this...",
    "category": "adverse"
  },
  {
    "text": "Every time I come in at 4:30 there’s no food being served cash registers off but have customers inside eating, sleeping or just simply sitting down in the dining areas.. and I once had a employee tell me they weren’t open but yet the doors were open people were inside and there were employees working and it says open 24 hour on the sign outside and online.. the false advertising has to stop.. and I will be calling corporate",
    "category": "adverse"
  },
  {
    "text": "The food and fast service are as expected from McDonald's.  The only problems are the frequent homeless panhandlers and other solicitors on Broadway outside the restaurant, and this is not all that controllable by the restaurant.",
    "category": "social"
  },
  {
    "text": "Chickens are sentient beings and deserve better treatment than McDonald’s grants them. McDonald’s has failed to meet even the low industry standards set by competitors like Starbucks and Burger King when it comes to caring for chickens. Caring consumers continue to speak up about the blatant cruelty McDonald’s allows in its supply chain, but management obviously doesn't care so I will be boycotting this McDonald’s location and every other until we hear of a commitment to a better policy for chickens!",
    "category": "social"
  },
  {
    "text": "This McDonald’s location is somewhat spacious. There are 2 floors. The staff is very attentive when taking your order. Also bathrooms are clean staff is always mopping floors and checking if the bathrooms are clean and tables. The only sad part is the amount of homeless people outside in the area. This McDonald’s is also near the train stations, (Fulton Street, Cortlandt Street, WTC) .",
    "category": "social"
  },
  {
    "text": "Probably one of the worst McDonald's restaurants to go to at night. Only one cashier operates and a person behind it serves drinks as well. I only spotted one or two people in the kitchen, so you can imagine how long it takes to get your food. If you are out at night and looking for a place to get food quickly - do not come. You will waste your time in a line waiting to order and waiting for your food.",
    "category": "waste"
  },
  {
    "text": "The place is awful, we entered with my children and at least five homeless guys were inside the restaurant. You feel totally unsafed , you cannot eat without thinking that you can lose everything. Completely dissapointing",
    "category": "social"
  },
  {
    "text": "This is the nasties McDonald's I've ever been in. Anytime I come here there's 10 homeless people sleeping in the seats. It's honestly disgusting. The smell alone is annoying when you're trying to eat. During the day it's okay. But after midnight avoid this place.",
    "category": "social"
  },
  {
    "text": "This place is a homeless Haven. I threw up in my mouth as a smell that should not be present in a place where food is served. I recommend this location if your interested in helping the homeless but I like my McDonald's I don't know clean.",
    "category": "social"
  },
  {
    "text": "There was alot of customers  waiting long for their food. The little mexican manager was rude he told me that I have to wait  after that asked for my money back. He lucky I was still in my uniform cause the time I wasted waiting for my food was crazy. I ended up going to Subways I was so upset I didnt eat the whole sandwich. If I wasnt in my uniform I would of went back to the store and threw my meatball sandwich at him.",
    "category": "waste"
  },
  {
    "text": "Good except for the homeless bumbs that loiter there after midnight. It's like the walking dead...they just stand around looking like vermin and the staff just let's them. Get the bumbs out and it'll be 5 stars.",
    "category": "social"
  },
  {
    "text": "I understand NYC has a homeless problem, but this McDonald on Broadway needs to address this problem. The smell and the constant harrasment by the homeless make's going there difficult.  Customer service is also on the back burner",
    "category": "social"
  },
  {
    "text": "Great burgers, for fast food. Be careful ordering. They only seem to serve meals. Ordered JUST a burger and got unwanted fries too. Also charges deposit on water bottles.",
    "category": "water"
  },
  {
    "text": "RACIST TO THE BONE.\n\nDon't take my word for it, go see for yourself.\n\nThey only hire Hispanics, if you are any other ethnicity they will not hire you.\n\nThey have ZERO white people working there and the only black person who works there cleans the toilets.\n\nThis is nothing new, it's been that way for as long as I can remember.\n\nI'm surprised no complaints have been filled with the Human Rights Commission.",
    "category": "social"
  },
  {
    "text": "This 24 hour dealie peaks right around last call, where you will no doubt encounter the wobbliest people in the the city. I was once asked by a probably-not-even-that-drunk Nigerian if I \"like to dance.... to music.\" Buried in the liminal space betwen 'dance' and 'to music' is everything you need to know about this shack of drunken insanity and their ersatz-eats.\n\nI highly recommend nothing on their menu, but what do you care, you're already wasted. If nothing else you'll walk out of here with your senses molested and 15,000 calories in a greasy bag. (And what the **** is a McDouble?)",
    "category": "waste"
  },
  {
    "text": "Restaurant de la chaîne hyper connue, propose des sandwichs et des salades. Très propres et bien entretenu, il est bondé de monde à cause de sa localisation. Les prix sont cohérents avec ce qui se pratique, les menu signature sont étonnement moins cher qu'en France. J'avais pris un quarter pounder with cheese (en pensant à un film de Tarantino), j'ai été assez déçu contrairement a ma compagne qui s'est régalé de son sandwich signature.",
    "category": "collector"
  },
  {
    "text": "Worst time ever.\nHuge seating area but every afternoon middle school kids make it impossible to sit and have a meal.\nTough environment to be between 3 and 5 pm",
    "category": "collector"
  },
  {
    "text": "Says its open 24hours but you can't place orders after 3am. A complete waste of a trip.",
    "category": "waste"
  },
  {
    "text": "Enjoy the food had a lot of homeless people taking up the seating in the dinning room and the second floor was close off",
    "category": "social"
  },
  {
    "text": "The real kudos should go to the night workers and the night crew for everything they have to deal with from dealing with the homeless drunk patrons and everything else especially when they're constantly understaffed and corporate and everyone else tends to ignore them",
    "category": "adverse"
  },
  {
    "text": "Service was poor. I ordered large Sprite and water and ice was given me. I got home when I found out. Somebody is not doing something right...",
    "category": "water"
  },
  {
    "text": "Ordered 3 McChicken, it was not well cooked and had some cartilage, also the lettuce were brown!!\nJust wasted $14",
    "category": "waste"
  },
  {
    "text": "It's a homeless shelter with a McDonald's no offense or disrespect to anyone homeless. Just describing the conditions of this establishment.",
    "category": "social"
  },
  {
    "text": "This location is awful.  It is dirty.  The staff is out of control.  McDonald's corporate should really take a close look at this location.  Extensive training is in need of the staff.",
    "category": "adverse"
  },
  {
    "text": "Love how fresh there fries are but too many homeless ppl just hanging in there",
    "category": "social"
  },
  {
    "text": "Food is really gross, and there are homeless people everywhere. the smell was really bad. no reason to go there.",
    "category": "social"
  },
  {
    "text": "Absolute zoo walking in. To be expected in lower Manhattan at 4 pm but none the less it was not worth the wait and there was a homeless man showering in the upstairs bathroom",
    "category": "social"
  },
  {
    "text": "Homeless haven in cold weather, stinky lives here, they need a 24 hour sanitizing crew to keep up with the crowds, foods fresh, fast enough service",
    "category": "social"
  },
  {
    "text": "You guys need to update the location hours. since I went at 5am and u wasn't open. THIS IS NOT A 24HR LOCATION DO NOT WASTE YOUR TIME!!!",
    "category": "waste"
  },
  {
    "text": "To many homeless,  there was 1 guy yelling inside,  my kids were worried he was going to hit somebody.",
    "category": "social"
  },
  {
    "text": "They are not 24hrs & they have a homeless man inside with the doors locked. I dont get it.",
    "category": "social"
  },
  {
    "text": "full disclosure not a fan of the chain, good coffee...homeless take over late night and management calls police instead of hiring their own security.",
    "category": "social"
  },
  {
    "text": "Food quality was poor, homeless sleeping upstairs and the restaurant was in bad condition",
    "category": "social"
  },
  {
    "text": "Is over priced, is always crowded, and homeless people hang in there.  I go once in a while.",
    "category": "social"
  },
  {
    "text": "Pretty quick, my problem relates to homeless and beggars; totally lost appetite.",
    "category": "social"
  },
  {
    "text": "In and out. There are usually a lot of homeless people in this location because of the timing but they have security these days.",
    "category": "social"
  },
  {
    "text": "Quick service, only one bathroom full of homeless and tourist",
    "category": "social"
  },
  {
    "text": "Slow service over crowding and unable to find seating due to the crowds and homeless people taking up most of the chairs",
    "category": "social"
  },
  {
    "text": "Just bought a bottle of water. Took forever and staff was rude",
    "category": "water"
  },
  {
    "text": "Of u don't mind the homeless people asking for money",
    "category": "social"
  },
  {
    "text": "This the only McDonalds in the world with DJ but at night there was many homeless in the restaurant",
    "category": "social"
  },
  {
    "text": "It was disgusting,homeless people sleeping at the tables,service was terribly slow",
    "category": "social"
  },
  {
    "text": "An issue with the homeless population late at night. Using it to clean and rest.",
    "category": "social"
  },
  {
    "text": "Too many homeless in this location. Sitting inside the McDonald's.",
    "category": "social"
  },
  {
    "text": "Dangerous at night. Drug deals happening in the restaurant.",
    "category": "social"
  },
  {
    "text": "Fast, good, bad Homeless around you!!!",
    "category": "social"
  },
  {
    "text": "To many homeless sleeping there.",
    "category": "social"
  }
]