[
  {
    "text": "The best authentic Italian food in NYC! Very warm environment and a true Italian family vibe. This is coming from an Italian!",
    "category": "uncategorized"
  },
  {
    "text": "Recommended by friends and thoroughly enjoyed. A cute, cosy atmosphere, excellent food - and definitely get the lobster croquettes!!! Cinzia our lovely host was also fabulous! An absolute must when you’re in Soho.",
    "category": "uncategorized"
  },
  {
    "text": "The service is good and food was great！Recommend this place to whoever love pasta！ Highly recommend the Tirmosu！！",
    "category": "uncategorized"
  },
  {
    "text": "Amazing food. Great service. Well located. Large portions. Interesting tastes. Warm atmosphere, quiet pleasant.",
    "category": "uncategorized"
  },
  {
    "text": "Very great lunch special & lovely service and ambience!! Very tasty, would highly recommend. They were able to accommodate a group of 7 within 30 minutes.",
    "category": "uncategorized"
  },
  {
    "text": "This was a very delicious meal with incredibly kind staff. Order the tagliatelle Verdi with wild boar and truffle",
    "category": "uncategorized"
  },
  {
    "text": "The pasta was very good, one of the best that I ate in NY and they fully represent the Italian culture. We served by Cinzia who was FANTASTICA!",
    "category": "uncategorized"
  },
  {
    "text": "Everything about this cozy spot was Spot on! Excellent attentive service and creative delicious food! Pastas are not to be missed and planning to be return here very soon.",
    "category": "uncategorized"
  },
  {
    "text": "What an amazing place . I got agniolotti and as italian i have to say piccola cucina made it even better than in most of the places in italy .\nI also found my favorite small cellar dhot grillet champagne which is almost impossible to find .\nAll in all this was an absolute top experience .",
    "category": "uncategorized"
  },
  {
    "text": "The best Restaurant in NYC. I have eaten in the best restaurants in all over the world and this ranks as one of the best.",
    "category": "uncategorized"
  },
  {
    "text": "This spot is great. The food is exceptional and affordable. Definitely recommend. If you are looking for comforting yet quality food, don’t hesitate to come. But book in advance at it get packed quickly.",
    "category": "uncategorized"
  },
  {
    "text": "Food and service were excellent! The vibe is very authentic and the service is adorable. Definetly recommend",
    "category": "uncategorized"
  },
  {
    "text": "Pasta is prefect, service is also good. It was kind of crowded in the restaurant, and the seat is tiny. Good for dating but not for family gathering.",
    "category": "uncategorized"
  },
  {
    "text": "Wonderful restaurant! The food was amazing, a small and comfy place to have traditionally Italian food!! We have such a wonderful time, the attention was on point, and the service was marvelous!",
    "category": "uncategorized"
  },
  {
    "text": "Absolutely AMAZING pasta and grrst staff! Highly recommend the lobster green pesto pasta or the truffle butter pasta, yummie!",
    "category": "uncategorized"
  },
  {
    "text": "Amazing pasta! I’d guesstimate it as the best in town if with a very cosy and busy atmosphere. Just go here!",
    "category": "uncategorized"
  },
  {
    "text": "Very good atmosphere with pleasant waiters and very good food. Wine is rather overpriced. We enjoyed the various pasta dishes, the meatballs and the dessert.",
    "category": "uncategorized"
  },
  {
    "text": "Awesome atmosphere and foods. Great for catching up with friends and family. The place feels very Italian.",
    "category": "uncategorized"
  },
  {
    "text": "Delicious authentic Italian food ! 10/10 definitely recommend ! Everything came fresh and on time even when it was so busy. A must visit",
    "category": "uncategorized"
  },
  {
    "text": "Fantastic spot for lunch or dinner. We went for birthday lunch and everything was phenomenal. Our server was Danielo and he was fantastic. Planning to go again soon!",
    "category": "uncategorized"
  },
  {
    "text": "Best Italian restaurant in Manhattan by far. We have been there tens of times and everyone of them is a special experience. Warmly recommended!!",
    "category": "uncategorized"
  },
  {
    "text": "We arrived at 7pm to a full restaurant so we had to wait a few minutes. Wow, this restaurant was worth the wait! Great selection of wine and absolutely stunning food + ambience!! Would fully recommend with no hesitation. AWESOME EXPERIENCE!!!!",
    "category": "uncategorized"
  },
  {
    "text": "Perfect dinner, I came several times. Very friendly staff and super good food. I absolutely recommend. Top quality/price",
    "category": "uncategorized"
  },
  {
    "text": "The place was amazing, the experience what phenomenal. I love the ambience and the experience and the custom service. I celebrated my birthday lunch here and they did no disappoint. Danilo was amazing and he had great customer service! 10/10",
    "category": "uncategorized"
  },
  {
    "text": "Great food, excellent service, Best Lasagnia in town, love the bread, try the pasta with a glass of wine",
    "category": "uncategorized"
  },
  {
    "text": "The best !!!! If u come in SoHo don’t miss this amazing opportunity to experience Italian culture food … when u are inside of the restaurant u feel somewhere in Sicilian the nice vibes 💜🇮🇹💜",
    "category": "uncategorized"
  },
  {
    "text": "Service is fab (Martine, I believe our server's name). Food was amazing and it looked as good as it tasted!",
    "category": "uncategorized"
  },
  {
    "text": "Good food, service, and wine. Daniloneas a great server. The service was very attentive. Very knowledgeable & always refills water glasses promptly. Super great deserts. We can for my cousins birthday and had a blast. They played music for her and made her really feel special. Amazing food. Tasted super fresh and delicious 😋",
    "category": "water"
  },
  {
    "text": "Great service, delicious food and a warming place ! Will definitely recommend. They are quick with the food and very on point with their service on the tables, had a great time with my family on Christmas night.",
    "category": "uncategorized"
  },
  {
    "text": "Delicious authentic food and experience. Amazing service by very friendly waiter René. Will come back many times. Don't miss it.",
    "category": "uncategorized"
  },
  {
    "text": "Great ambience! Food is l delicious and fresh! Highly recommend- ask for Rene. He was great and very attentive!",
    "category": "uncategorized"
  },
  {
    "text": "I can truly call myself a frequent flyer here. I am also afraid I will have to start paying rent to this restaurant soon. Everything on the menu is a creation of a brilliant chef Gioele La Rosa and is a definition of authentic Sicilian Cuisine. My current obsession is the Truffle Pasta special that they have during the winter.",
    "category": "uncategorized"
  },
  {
    "text": "They have really good food! Nice and comfortable ambience. The employes were very professional, in especial the server Danilo.",
    "category": "uncategorized"
  },
  {
    "text": "Excellent food and service! Everything was better than we expected. Danilo our server was really friendly and helpful. We are so satisfied",
    "category": "uncategorized"
  },
  {
    "text": "Excellent spot! The sauce (gravy) was excellent! Service was impressive! The owner made sure everyone was happy and content!",
    "category": "uncategorized"
  },
  {
    "text": "Excellent service and food… can’t wait to come back!! Great for families, or that special occasion… friendly staff and atmosphere.",
    "category": "uncategorized"
  },
  {
    "text": "All the dishes left me speachless! Wonderful restaurant, manager and waiters very kind and friendly, in particular Hector :) Best Italian restaurant in SoHo",
    "category": "uncategorized"
  },
  {
    "text": "The spaghetti here is the best I have ever had!! Dessert is wonderful! Waiter is are very nice!! Definitely come again",
    "category": "uncategorized"
  },
  {
    "text": "Great spot, great food and great service! Hector took great care of us and made sure we enjoyed everything. Amazing spot for a special occasion.",
    "category": "uncategorized"
  },
  {
    "text": "Food — delicious! Service — exceptional! Will definitely visit again. 10 out of 10 would recommend!",
    "category": "uncategorized"
  },
  {
    "text": "My favorite spot! Have been coming here since 2018 and it’s still my favorite restaurant in nyc. A must!",
    "category": "uncategorized"
  },
  {
    "text": "had one of the best meals ever here! forget about all the “hyped” Italian restaurants in nyc. this is one of the best pastas I’ve ever had (including Italy) + milanesa. renee was our server and he couldn’t have been more pleasant or helpful. he definitely made our experience that much better as well as all the bussers throughout the meal. this restaurant is a gem in soho and I couldn’t rave about it more!",
    "category": "uncategorized"
  },
  {
    "text": "Best Italian/Sicilian restaurant in NYC ! All locations are phenomenal ! My personal preference Piccolo Cucina Estiatorio - for me it feels like home ! I have been coming here since the day they were open. I love everything about this place. Food - delicious ! Very friendly stuff ! Cozy atmosphere ❤️❤️❤️",
    "category": "uncategorized"
  },
  {
    "text": "The pastas are amazing. The tiramisu is super good. The tables are a bit small but the environment inside the restaurant is friendly and nice.",
    "category": "uncategorized"
  },
  {
    "text": "My favorite place in NY! Love pasta here, always fresh and delicious! Highly recommend to try steak too, perfectly seasoned and cooked!",
    "category": "uncategorized"
  },
  {
    "text": "Shared three pasta dishes with two picky pre-teens and EVERYTHING was devoured. Fanatic food, super attentive service. Great experience.",
    "category": "uncategorized"
  },
  {
    "text": "Piccola Cucina is simply put, my home away from home. Cozy and charming, If I want to feel and eat like I am back in Sicily, this is where you will find me. The amazing staff is always attentive and friendly. And the Excutive Chef Gioele La Rosa, is the very definition of a culinary artist. So creative and masterful in creating the most delectable and original dishes, inspired by Sicilian and Italian gastronomy. If you want to have a great dining experience and savor genuine Sicilian recipes and original creations, definitely try Piccola Cucina Estiatorio.",
    "category": "uncategorized"
  },
  {
    "text": "Amazing service and food! When I am in New York City, it’s my number one place to go. Food is exquisite and very homie! Service is always impeccable!",
    "category": "uncategorized"
  },
  {
    "text": "Whenever I visit the city, I try to make it here. Food is superb and the quality and taste never change. Delightful and unforgettable!",
    "category": "uncategorized"
  },
  {
    "text": "I ve been here a couple of times alredy, always amazing ! Food is excellent, great wine list , amazing service !",
    "category": "uncategorized"
  },
  {
    "text": "Recently, I had an extraordinary dining experience at La Piccola Cucina. From the moment I stepped in, the ambiance exuded sophistication. The menu, a culinary masterpiece, offered a delightful fusion of flavors that danced on my palate. Each dish was meticulously crafted, showcasing the chef's expertise and creativity. The attentive staff anticipated our needs, enhancing the overall enjoyment. The wine pairing was impeccable, complementing the exquisite courses perfectly. Dessert was a sweet symphony of indulgence. Gastronomia Elegante is more than a restaurant; it's a gastronomic journey that transcends expectations, leaving an indelible mark on the senses. An absolute culinary gem!",
    "category": "uncategorized"
  },
  {
    "text": "Best pasta in NYC! Usually we go there for family occasion celebrations but sometimes stop by for dessert only. This is the must go place for pasta lovers as each dish is unique, flavourful, and super tasty. It was recommended to me by sicilian friends from Italy and they knew what good italian food should be like!",
    "category": "uncategorized"
  },
  {
    "text": "This is my favorite italian restaurant in NYC and trust me I love pasta more than anything. The dishes are not typical italian restaurant in America. You really feel like you are eating food in Italy. I have tried pretty much every dish on the menu. Even though I do not like eggplant, my favorite dish is Maccheroni alla Norma. Chef is super talented and creative. I recommend going there for sure. Survice is great as well and Friday after 10pm is like a party.",
    "category": "uncategorized"
  },
  {
    "text": "My first time in New York and I chose one of the best rewiewed Italian food restaurant. To my pleasure, I have to admit the five stars are all deserved: the place is tiny and warm, perfect to hang out with friends; the menu is rich in variety and satisfies every Italian taste; the waytresses are very nice and professional; the food is delicious and it respect Italian tradition, as well as being well presented.\nI recommend to try the pasta and, for dessert, the cannoli.\nI also hope to come back soon and bring over other friends of mine, for a taste of good Italian food",
    "category": "uncategorized"
  },
  {
    "text": "Bono!!!bono!!!bono!!! Amazing place with amazing service Food is 10/10 They combine italian cuisine with a more sophisticated style that turns out to be an excellent combination",
    "category": "uncategorized"
  },
  {
    "text": "Best pasta in NYC! Very amazing service and big dishes. Came here to celebrate a friends birthday and there were so many options we could choose! Will definitely be back!",
    "category": "uncategorized"
  },
  {
    "text": "The food was fantastic!!! Highly recommend the lemon cheese cake!!!!!!!!!! It is best cheese cake I have ever had.",
    "category": "uncategorized"
  },
  {
    "text": "Great great great food!! I’m loving it. Come and enjoy. Amazing amazing amazing. Molto buono buono buono. Autentico",
    "category": "uncategorized"
  },
  {
    "text": "I’ll feel like home every time I have dinner here! The primi piatti are amazing and there is a very good wine selection.",
    "category": "uncategorized"
  },
  {
    "text": "Best food in town. No discussion. Authentic Italian. Just come here and enjoy life. Buonissimissimissimo!!!!",
    "category": "uncategorized"
  },
  {
    "text": "Great food and ambience! Had a great time at the restaurant. The staff was very friendly. Highly recommend this restaurant for food enthusiasts",
    "category": "uncategorized"
  },
  {
    "text": "Great atmosphere and best staff. I like the food. First time trying Italian restaurant for full dinner and best.",
    "category": "uncategorized"
  },
  {
    "text": "We came here for a friend gathering, the service is so good and the food is amazing and excellent, the pasta is high recommend!",
    "category": "uncategorized"
  },
  {
    "text": "What a find!!! Fabulous food and wine list and the service was over the top!!! So worth the trip from Connecticut that we’re going back in a few days!",
    "category": "uncategorized"
  },
  {
    "text": "Found the spot by accident a few years before Covid and the staff was fantastic. My mom was born in Italy so there was a natural connection - we never eat Italian out and this the ONLY place me and my family will go if we go out for Italian food. The cuisine is fresh, tasty and very well presented, it’s always delicious. The people and the atmosphere really help make the experience truly phenomenal. This is one of my favorite places in New York City, from start to finish. Everything from service to food is top top notch.",
    "category": "uncategorized"
  },
  {
    "text": "Tiny spot and the non-accessible bathroom, dishwashing area and kitchen are tiny, too. Great menu, Italian, and great-tasting papperdelle with funghi. I would return happily.",
    "category": "uncategorized"
  },
  {
    "text": "Went with my boyfriend for date night. Our server Danilo was so fantastic that we would come back just for him even if we didn’t enjoy the food. Luckily that was not the case — the food was incredible and we left full and satisfied. I cannot emphasize enough how warm and personable Danilo was — he truly made our dinner 1000x better. All his recommendations were excellent and we enjoyed watching him prepare the special Christmas dessert (I forgot what it was called) right next to our table. Besides that, the overall warm ambiance of the restaurant was fantastic, and we particularly loved watching the servers dance when the music came on. My boyfriend and I will be returning. Also the zucchini and clam gnocchi and tagliatelle with wild boar sauce were both delicious!",
    "category": "uncategorized"
  },
  {
    "text": "Went here with my friend for her birthday and had an amazing night thanks to the hospitality at Piccola Cucina! We enjoyed the burrata to start, delicious pastas, and finished the meal with some cannolis. Highly recommend!",
    "category": "uncategorized"
  },
  {
    "text": "Incredble!!!! the pasta, the wine, the apps & the dessert <3 the staff was so friendly and we had the best time meeting our neighbors too… so many birthdays! what a lively little spot",
    "category": "uncategorized"
  },
  {
    "text": "Best gluten free pasta in town by a long way. Highly recommend plus the staff is super friendly. Been going for years and the quality remains fantastic.",
    "category": "uncategorized"
  },
  {
    "text": "Fantastic authentic Italian restaurant with Sicilian influences, excellent service, wonderful food and reasonably priced",
    "category": "uncategorized"
  },
  {
    "text": "Just delicious. Lots of locals who know this place is awesome. Truffle tagliatelle - wow! Great service, so much character - thanks guys!",
    "category": "uncategorized"
  },
  {
    "text": "Danielo was amazing! He took great care of us and the food was the best! I especially enjoyed the lobster linguine and truffle pasta! The fried calamari was so crispy and fresh! The tiramisu is to die for 5/5 for service and food.",
    "category": "uncategorized"
  },
  {
    "text": "Such a fabulous restaurant, best authentic Italian! Delicious food, great service, cozy atmosphere. Our server Cinzia was great, helpful and ready with all the recommendations! 10 out of 10 recommend!!!!",
    "category": "uncategorized"
  },
  {
    "text": "Amazing lunch with my girls ! Super nice and warm ambient , we loved it! The food ? Is still the best Italian in town and even so cheap ! 🤍",
    "category": "uncategorized"
  },
  {
    "text": "This place is so amazing! Cinzia is a very kind waitress and attentive! Highly recommend for great pasta! 10/10",
    "category": "uncategorized"
  },
  {
    "text": "Real italian food! Awesome service by Danilo. We will return soon! The multiple flavours popping up on my gustative papilas was an incredible experience! THANK YOU SO MUCH ❤️ Ciao 🇮🇹🍝",
    "category": "uncategorized"
  },
  {
    "text": "Amazing food, amazing atmosphere and amazing server. Cinzia was super helpful with suggesting which wine and food to choose for our group. She took care of us and anyone would be lucky to have her as your server.",
    "category": "uncategorized"
  },
  {
    "text": "This was one of the best dining experiences anyone could ask for in NY. You are immediately surrounded by the kindest and warmest people, and are engulfed in the kind of amore only Piccola Cucina could have. The food also is full of love, would highly recommend you trust in the daily specials and treat yourself.\n\nA special shout-out goes to Cinzia, who is such a lovely human and who immediately took care of our table of 7 with delicate care. You will be the luckiest person in the world if she is the server for your table. She is so funny, kind, and just all around amazing. She made the experience that much more special.",
    "category": "uncategorized"
  },
  {
    "text": "Fabulous time. Fabulous food. Cinzia was amazing. Un bouno ristorante a New York.\n\nFood was very authentic. The atmosphere was so fun. And the server, Cinzia was absolutely fabulous.\nI got to practice my Italian and she gave me the best wine recommendation. Il cuoco was so nice to chat with too.\n\nWill be back.",
    "category": "uncategorized"
  },
  {
    "text": "Cinzia was incredible!! We loved the experience and will be back very soon. We will be recommending to friends!",
    "category": "uncategorized"
  },
  {
    "text": "Delicious! Cynthia was the best waitress. We love it here. We got the calamari, the croquettes, tagliatelle, and cavatelli. 10/10. Must try! Yummy.",
    "category": "uncategorized"
  },
  {
    "text": "Best italian restaurant un New York cita! Best attention from Cinzia, kind, great recomendations and very efficient! Will always come back.",
    "category": "uncategorized"
  },
  {
    "text": "Great food. Cinzia was the best! You should go to this place for pasta and mushrooms dishes, my favorites!",
    "category": "uncategorized"
  },
  {
    "text": "OMG! This place is amazing . I loved the place and our food!! Grilled calamari is a must. Our waitress was amazing - Cinzia - ask for her and you will be happy you did.",
    "category": "uncategorized"
  },
  {
    "text": "OMG!!!!Amazing food and amazing service. We did not expect this to be so much fun or to be so delicious. Everything was wonderful. My first time here and I can’t wait to come back. Cinzia was fantastic.",
    "category": "uncategorized"
  },
  {
    "text": "This is by far the best Italian restaurant in New York City. If you want to have real Italian food, you should come and try this place. Their pasta is amazing and the service is impeccable. I really recommend you to give it a try, you won’t be disappointed!",
    "category": "uncategorized"
  },
  {
    "text": "Amazing restaurant ! The food is really great and Italian approved. I tried the “trofie con pesto di calamari, pistacchio e tartufo” and it was like eating in Sicily. The place is really nice and the quality of the food is very high. Chef Gioele’s creation are a must try in NYC!!",
    "category": "uncategorized"
  },
  {
    "text": "Went for dinner with friends and had an amazing night. Cynthia took care of us and she had excellent recommendations, particularly regarding the Brunello. We started with the antipasti - both of the specials including croquettes and tomato carpaccio, had 4 different pastas (try the oso buco ravioli!), and finished with tiramisu. Thank you to Cynthia for an excellent night!",
    "category": "uncategorized"
  },
  {
    "text": "Piccola Cucina remains as the #1 Italian, and specifically Sicilian, restaurant in Manhattan. I have been eating at this location, and their others in the city for many years, and after moving to Italy 4 years ago, we wanted to come back and see if it has changed, and thankfully, it is still our favorite Italian restaurant in the city. I have tried everything on the menu and whenever my guests come here, they all also enjoy the quality, selection and price here. Compliments to the owner, the chefs, and the staff for keeping the high quality, which is actually equivalent to the food we now eat in Italy. Grazie, grazie, grazie, and we will be returning in January, and we are already looking forward to it!!!",
    "category": "uncategorized"
  },
  {
    "text": "It's one of those places where you always feel at home! The food is delicious and the people who work there are amazing! Highly recommended!!!",
    "category": "uncategorized"
  },
  {
    "text": "Had a beautiful dinner Cindia was our waitress she was amazing with a beautiful Italian accent. The food was amazing all The pasta dishes. Get the carpaccio and the octopus burrata. You cannot go wrong.",
    "category": "uncategorized"
  },
  {
    "text": "We absolutely LOVE this place. Been several times, consistently GREAT. AUTHENTIC Sicilian dishes expertly prepared. Fun and lively vibe. Friendly and helpful service. Come with an appetite! Come with a group so you can taste all of their delicious offerings.",
    "category": "uncategorized"
  },
  {
    "text": "Excellent!always good food and fresh ingredients. Staff is the best!we will be back again. Polpo is great and all the pasta amazing. Top class",
    "category": "uncategorized"
  },
  {
    "text": "Don’t forget to try Tagliatelle verdi, lasagna della Mamma Rosa, Tiramisú, Limone cheesecake and cannoli",
    "category": "uncategorized"
  },
  {
    "text": "Beeeesssst Italian restaurant! Food is always excellent, staff is stellar and vibes are impeccable! Absolutely phenomenal. Have been returning frequently since the first time I went years ago. A must in the city!",
    "category": "uncategorized"
  },
  {
    "text": "great food and service, as always. have been coming here for years and it always feels like you are in Italy.",
    "category": "uncategorized"
  },
  {
    "text": "i love the vibe they danced and sang and the food was really good and its very cozy its just small inside",
    "category": "uncategorized"
  },
  {
    "text": "One of the classics for best italian food in the city\n\nWell curated menu with wide and unique selection. Ambience is always cozy, lively, warm. Servers are well versed on the wine list, give very good suggestions and very welcoming and warm.\n\nThe desserts are amazing - esp the secret cannoli…..",
    "category": "uncategorized"
  },
  {
    "text": "After the first bite you will feel instantly in Italy. All the pasta are sublime and also the “crudi”. Always ask for the specials of the day. An Italian gem in the heart of soho!",
    "category": "uncategorized"
  },
  {
    "text": "Piccola Cucina Estiatorio - this is the best of the best. Great restaurant for family style eating. All of the food was delicious, especially the calamari, octopus, fish and pasta! Service is friendly and helpful and the overall vibe feels quite homely. Prices are really good as well. SEE PHOTOS!!!!! Highly recommended to everyone!",
    "category": "uncategorized"
  },
  {
    "text": "As somebody who lives in SoHo and loves Italian food, I could confidently say that La Piccola Cucina not only has the BEST and most AUTHENTIC Italian food in the area, but the staff, the chefs and the ambiance of the restaurant is welcoming and inviting to all. The price point is NOT offensive and the portions are enough to leave you satisfied. I bring my friends and family to La Piccola Cucina every time they’re in the area and they all love it! Highly recommend!!",
    "category": "uncategorized"
  },
  {
    "text": "This is one of the best Italian restaurants in all of NYC. I’ve had some excellent meals in Italy and am so happy to be able to find ab authentic Italian restaurant that offers amazing seafood, pastas & vino! Everyone is super friendly and makes you feel like you’re home or away in Italia! The atmosphere is warm, convivial & fun. You can find fun music on Friday and Saturday evenings and even some towels dancing in the air if you’re lucky enough. The restaurant is run by an awesome and friendly team especially the chef, Gioele who always has interesting specials and Bernadetta, both sweet and gracious hosts. I live on the other side of town but this remains my go-to despite the distance!",
    "category": "uncategorized"
  },
  {
    "text": "Pasta was delicious. Cinzia was our server and she was so lovely! Really enjoyed chatting with her about where in Italy she is from, just made the whole experience even more authentic!",
    "category": "uncategorized"
  },
  {
    "text": "Food is really good and Danilo was very kind. Amazing cannoli. Tuna tartare was great also. Definitely will come back when in NY again.",
    "category": "uncategorized"
  },
  {
    "text": "I love everything in Piccola cuccina, thank you so much chef Davide and Gioele. See you next time!!!",
    "category": "uncategorized"
  },
  {
    "text": "Restaurant, clean, well organised, excellent quality food, cooked by really good Italians... I recommend it to all those who want to try well-made Sicilian cuisine in New York",
    "category": "uncategorized"
  },
  {
    "text": "Cinzia made the experience amazing! She knew the menu and recommended amazing food. Definitely would recommend this place!",
    "category": "uncategorized"
  },
  {
    "text": "Cinzia was an amazing waitress! So helpful and patient. Service was beyond exceptional! Tastes just like Italy Definitely will be back!",
    "category": "uncategorized"
  },
  {
    "text": "The experience was incredible. The food was excellent, with diverse tastes and options, great wine list and very good desserts. The service was the best, always attentive to consult you if you need anything.\nI recommend it, especially for the quality of the dishes and the service",
    "category": "uncategorized"
  },
  {
    "text": "We loved everything about the restaurant. Every time we are in NY this is a must go place. Staff and waiters/waitresses are all absolutely amazing!",
    "category": "uncategorized"
  },
  {
    "text": "Great food, great place and kids friendly! We liked it here so much that we came back for the second time.",
    "category": "uncategorized"
  },
  {
    "text": "Food was amazing as always, this is my fav restaurant in NY, but the guy who was taking care of us today, he had like an attitude, honestly I didn’t like his service, was a bit rude, I saw arriving the other staff that I’m familiar with, probably he is new, or just lunch shift, but still my fav place!",
    "category": "uncategorized"
  },
  {
    "text": "The food is wonderful and fresh. The waiters are very nice. The service is fast. You should do a reservation, it’s busy. I recommend this place ! We had a great time.",
    "category": "uncategorized"
  },
  {
    "text": "There was 14 of us for my sisters graduation dinner. Food was amazing and always and have to give a special shout out to Cintha, our sever who was on point with great service and handled our large party effortlessly!",
    "category": "uncategorized"
  },
  {
    "text": "Our dining experience at this restaurant was truly exceptional. What made it even more special was the chance encounter with a charming Italian couple who work in the neighborhood and declared it as their favorite spot. As seasoned New Yorkers with over a decade of living in the city, we’ve become discerning food enthusiasts, but this restaurant managed to genuinely impress us. The food was outstanding, and the service was impeccable, leaving us thoroughly delighted with the entire experience.",
    "category": "uncategorized"
  },
  {
    "text": "Amazing service and food! The staff was super helpful in welcoming our 10pp NYC marathon party, the table was ready on time and our waitress Linda was incredible. Shoutout to Gioele the chef that runs the kitchen like clockwork!!! Food was delicious, to die for!",
    "category": "uncategorized"
  },
  {
    "text": "We had a memorable experience at this place. I had the Green Tagliatelle with wild boar ragu and it was incredible. Danilo was our server and made sure we had the best time. He is very knowledgeable about the wine menu and all the food pairings. Highly recommend this place.",
    "category": "uncategorized"
  },
  {
    "text": "We walked up on a Saturday at 3:15 pm. The place was very busy, but we got a seat within 20 minutes, no reservation. The food and service were fantastic, as it has been on my other visits before",
    "category": "uncategorized"
  },
  {
    "text": "Delicious & authentic Italian Food. Professional, kind and great service. Cinzia & Alfio made our night!",
    "category": "uncategorized"
  },
  {
    "text": "Amazing food, atmosphere and fantastic service. Our waitress Cinzia was attentive, polite and gave great recommendations. The rest of the staff was great as well.",
    "category": "uncategorized"
  },
  {
    "text": "The atmosphere, the food, the service- 10/10!!! Ceniza was our waitress and AMAZING. We live in NYC and have been to many places, this is a Must Come Back!",
    "category": "uncategorized"
  },
  {
    "text": "Everything was delicious. Staff (Cynthia) was very helpful and attentive. The place is very cozy. We reccommend",
    "category": "uncategorized"
  },
  {
    "text": "Very good place Delicious food crowded place Reasonable prices Quue for seating Elagant people It is worthy coming! Have fun!",
    "category": "uncategorized"
  },
  {
    "text": "Delicious food and excellent service! This was a really good experience and and amazing place to have dinner with friends.",
    "category": "uncategorized"
  },
  {
    "text": "Delicious food, and great service and vibe! My favorite dish was a pasta with lobster. Highly recommend and would I’ve to come back.",
    "category": "uncategorized"
  },
  {
    "text": "Looked for an Italian restaurant close to our hotel in Tribeca on a Thursday night. Piccolo Cucina Estiatorio had good reviews and they deserved it. It was busy and fun, we got in immediately, professional wait staff, delicious food, and they made us feel welcome. From the manager to the kitchen - it was excellent! A neighborhood find.",
    "category": "uncategorized"
  },
  {
    "text": "Exceptional Italian restaurant in NYC. Outstanding service, cozy ambiance, perfect for a friend's dinner.",
    "category": "uncategorized"
  },
  {
    "text": "Great pasta and even better service from Pablo. I recommend the fusilli ni, incredible. Such a lovely dinner!",
    "category": "uncategorized"
  },
  {
    "text": "We love this place, every time we come to Soho we stop here to have lunch or dinner. Cinzia is the best! She is always very nice with us!",
    "category": "uncategorized"
  },
  {
    "text": "Came to Piccola Cucia with my family whilst visiting New York and it is perhaps the best Italian food we have EVER had! Everything was exceptional - from the food, the service and the atmosphere. Special shout-out to our server Jorge who was amazing. Cannot recommend this place enough!",
    "category": "uncategorized"
  },
  {
    "text": "Cinzia it was super friendly! Fresh pasta ! Great service, amazing food and super cozy! Super affordable",
    "category": "uncategorized"
  },
  {
    "text": "Too bad there aren’t more stars to click on. As a Sicilian/Italian every time I go to an Italian restaurant I have to always settle for the close enough. Not this time at Piccola Cucina Estiatorio, 71 Thompson Street NYC. After seeing their extremely authentic Sicilian menu online I knew that it had to be the real thing. After easily reserving a table online we showed up with yes our hopes being very high. For the first time the food was everything I had hoped for.\n1. Arancini: nicely crunchy and flavored. Not oily or old at all.\n2. Grilled veggies: although simply presented they were really tasty and fresh.\n3. Involtini: out of this world. Exactly made like in my town in Sicily. A Moist, tender, flavored with some really tasty mozzarella cheese, served on a nice bed of caponata.\n4. Maccheroni alla Norma: finally my very favorite dish. I almost cried. Besides a fantastic pasta, rigorously cooked al dente, there was a more than generous amount of diced eggplant, obviously, with basil leaves, olive oil and everything the Mediterranean has so generously given to Sicily for thousands of years. It’s worth mentioning the more than welcome grated “ricotta salata” as a testimony to the high attention to detail of Chef Gioele. That was a dinner I will not easily forget.\nThe last thing I want to say is that, according to the highly professional and attentive staff, almost every single ingredient in this restaurant is flown directly from Sicily including the very tasty cannoli filled with ricotta cheese. (The cheese flies frozen during shipping).\nSorry for the long review. I only wanted to show my super happiness with this restaurant. ANGELO.",
    "category": "uncategorized"
  },
  {
    "text": "One of my favorite places in the city! Try the cavatelli with sausage and fennel, and listen to Cynthia when she tells you what wine to get - she’ll be right, on top of being lovely and attentive.",
    "category": "uncategorized"
  },
  {
    "text": "La Piccola Cucina Estiatorio is our first stop in New York. Chef Joelle is a master chef in italian food, The place is cozy, great wine options and extraordinary and fresh italian food.",
    "category": "uncategorized"
  },
  {
    "text": "Fantastic experience and the food was amazing! Cynthia was an amazing server and gave the best recommendations! Thank you!",
    "category": "uncategorized"
  },
  {
    "text": "The food was SUPERB, and lovely people work here. 100/10 would recommend. Best Italian food we've ever eaten. By a long way.",
    "category": "uncategorized"
  },
  {
    "text": "Cinzia was a great server !! The food was delicious and the service was quick. I love the atmosphere <3",
    "category": "uncategorized"
  },
  {
    "text": "The perfect spot to take a date or for the whole family. Great atmosphere and even better food! Even though there are so many restaurants in NYC I would pick this one first.",
    "category": "uncategorized"
  },
  {
    "text": "Great service and food, my waiter was Cynthia! She was so kind and helpful. Would definitely come back just for her!",
    "category": "uncategorized"
  },
  {
    "text": "Great spot for casual lunch in Soho, service is always fantastic, our waitress Cinzia was great! Their pasta is always a hit.",
    "category": "uncategorized"
  },
  {
    "text": "Small space, amazing Sicilian food and wine. We would highly recommend. Very authentic. Truly wonderful and felt like I was back in Sicily.",
    "category": "uncategorized"
  },
  {
    "text": "Some of the best Italian food I have ever had. Very nice staff and costumer service. Would recommend.",
    "category": "uncategorized"
  },
  {
    "text": "Great spot but even more important... great food and lovely people. Make a reservation or wait in a long line. It's up to you😉",
    "category": "uncategorized"
  },
  {
    "text": "Great evening, we went with the fish theme: Gambero Rosso, Trofie and Fussili with fish. Cinzia is amazing 🥇🤝🏼",
    "category": "uncategorized"
  },
  {
    "text": "Amazing food and service! Our server Cynthia was so accommodating and friendly. Overall a great experience. Will be back soon!",
    "category": "uncategorized"
  },
  {
    "text": "Favorite restaurant in NYC. Food is amazing, service is great, and the it is in one of the best parts of nyc in my opinion! My friends and I have been coming every week for lunch for the past 3 months",
    "category": "uncategorized"
  },
  {
    "text": "Delicious food. I love when waiters are knowledgeable. Jorge pays attention to detail, has great recommendations and takes time to explain every dish Outstanding service Loved the place and food combination. Branzino was delicious and pasta with shrimp amazing Will come back. Prices reasonable",
    "category": "uncategorized"
  },
  {
    "text": "We were staying in Soho for a week and we went to eat here twice. Service was great - friendly and responsive. Food was fantastic and affordable. Wine was delicious. Atmosphere was fabulous.",
    "category": "uncategorized"
  },
  {
    "text": "I like this place !! The food was delicious and the service was great. Pablo was amazing he makes us feel like in home.",
    "category": "uncategorized"
  },
  {
    "text": "Food and service are at top quality!! As Sicilian I never tasted so good cannoli out of Sicily like their!! Branzino and pescespada we ate were fresh and well cooked! Well done!! We will be back again and again …",
    "category": "uncategorized"
  },
  {
    "text": "Spectacular I enjoy my time I enjoy the food I enjoy everything the service is so good The food is so delicious",
    "category": "uncategorized"
  },
  {
    "text": "Great experience! The quality of the food is great, the atmosphere is very pleasant and the staff very efficient. Special shout out to Gabriele from Sicily who was particularly kind and helpful. In overall, I recommend the place!",
    "category": "uncategorized"
  },
  {
    "text": "Best Italian restaurant in the city! Lasagna and Branzino super. The staff was friendly and in particular Gabriele made me feel like in Italy 🇮🇹 ❤️‍🩹",
    "category": "uncategorized"
  },
  {
    "text": "very nice and characteristic place, excellent food as well as the service itself. you feel like you're in Italy!!!!!!!",
    "category": "uncategorized"
  },
  {
    "text": "I had a very good lasagna, really recommended, a place to finally eat healthy and really excellent, very friendly staff and if you are Italian you will feel at home.",
    "category": "uncategorized"
  },
  {
    "text": "food - comme ci comme ca ( full of sault)\nservice - terrible\nthere were places outside - they insisted to put us in\nour weather was a total mess!\nwill never ever return\ntiramisu - mediocre - we haven't finished it!\nsave your time and money and go to other places in New York",
    "category": "uncategorized"
  },
  {
    "text": "The head waiter is arrogant and prejudiced. Judge people by wealth. It took a long time to make requests and even pay. It's a shame a nice restaurant, have a head cheff which spoils the whole environment.",
    "category": "uncategorized"
  },
  {
    "text": "The food is good , the location is nice and the staff is very attentive ! We loved the ravioli and the Arancini!",
    "category": "uncategorized"
  },
  {
    "text": "The food was just amazing, real, true authentic Italian selection in the menu! It was so good that I had to come back three times in the same week; the service was impeccable and the chef Gioele gave us great culinary advices and company! Definitely a place to go if you want to experience a delicious Italian meal!",
    "category": "uncategorized"
  },
  {
    "text": "I had the most delightful experience at the Italian restaurant on Thompson Street in New York. From the moment I stepped in, I was transported to the heart of Italy. The warm and cozy ambiance, combined with the charming professionalism of the waitress Cinzia, set the perfect stage for an unforgettable meal.",
    "category": "uncategorized"
  },
  {
    "text": "I went there with my wife and I gotta say how pleasant my lunch was. The restaurant is very cozy and the staff was deeply receptive, the food portion were great and the food taste was amazing. So I am definitely coming back and recommend anyone to try it out.",
    "category": "uncategorized"
  },
  {
    "text": "The service was terrible. As there was a table with 5-6 partying people, all staff was focused on this table. Other tables were forgotten. Extras to the main dish came after the main dish was finished. No respect to the customer, no apologises from the staff after the extras were rejected. Just a bill!.. If You want to eat and feel general service - skip this place.",
    "category": "uncategorized"
  },
  {
    "text": "Sorry.I've been here at least once each year for 5 yrs. This is the worst service ever. Food was ok but the nice staff service was gone. What happened.",
    "category": "uncategorized"
  },
  {
    "text": "We had come to the sister restaurant years earlier with friends and had not managed to find it again till now. A hit summers day and a great lunch. Cesar salad with lovely feta and balsamic to share then pasta sausage fennel and ricotta, both beautiful in a beautiful setting. Great service from a sengelese waiter who gave some great other food suggestions for out nyc stay",
    "category": "uncategorized"
  },
  {
    "text": "It's an excellent place. Great service and food. I would come here at every visit to new york city.",
    "category": "uncategorized"
  },
  {
    "text": "I'm sure this place was once amazing, but now it feels tired. The service is snotty. Never coming back",
    "category": "uncategorized"
  },
  {
    "text": "Very nice Italian food, good service and reasonable prices, this restaurant is definitely a go. We took one of the two tables on the sidewalk just after sunset on a very hot summer day, and had a memorable experience.",
    "category": "uncategorized"
  },
  {
    "text": "I’m not sure who’s giving this place good ratings since their food was undercooked and very underwhelming service both times I have gone. The waiter never even came to refill water. Went with two different groups both times and had the same experience.",
    "category": "water"
  },
  {
    "text": "I love eating at Piccola Cucina Estiatorio ! Great service and location, it feels like being in Sicily ! Had a new entry from the menu: Trofie pasta with calamari sauce , pesto and truffle , Tasty yummy combination! Also I enjoyed lemon potatoes. Every time I go I enjoy tasty dishes - portions are quite big ehi but my friends like eating a lot :) ! And finished with the delicious Cannoli made in Sicily and filled fresh upon serving, that makes a tasty crunchy cannoli with a fresh ricotta filling. Can never go wrong !",
    "category": "uncategorized"
  },
  {
    "text": "Piccolo Cuccina is so good that the drive from Washington DC is worth it! Their customer service is exceptional.",
    "category": "uncategorized"
  },
  {
    "text": "This spot was amazing from the food, service, ambiance and selections of wines. The service was exceptional our waiter Pablo Pedraza was very helpful and recommended a great selection of wines and dishes from the menu. My husband & I had a great time. We will definitely be coming back.",
    "category": "uncategorized"
  },
  {
    "text": "An authentic Italian restaurant in the heart of Soho! The staff and chefs are friendly and always available to satisfy your requests. The food is just excellent! I wide choice of pasta (try Fusilloni di Gragnano con scampi e burrata, rigatoni pesto and lobster ragu, tagliatelle verdi with wild board ragu and truffle.) If you love seafood, you are in the perfect place, their tartare and trio di carpaccio is fresh and really good. Desserts are unbelievable! Cannoli and the tiramisu are a must to try. My favorite restaurant in the city by far.",
    "category": "uncategorized"
  },
  {
    "text": "some of the best italian food in NYC! and i am from italy myself, so you know this is a legit restaurant!",
    "category": "uncategorized"
  },
  {
    "text": "Really great experience! I had octopus, parmigiana, gnocchi with zucchine and clams, cannoli. Everything was excellent!",
    "category": "uncategorized"
  },
  {
    "text": "Amazing Italian restaurant in NY!the food is delicious, portions are generous and the service impeccable. As an Italian myself, this is the place to go if you wanna feel at home. Will definitely come back!",
    "category": "uncategorized"
  },
  {
    "text": "Great food and great vibes. The food is delicious and the staff is incredible. Will definitely be going back soon!",
    "category": "uncategorized"
  },
  {
    "text": "Went with some friends for dinner. The waitress was very nice and attentive to us the entire night. We started with the fried burrata special topped with salmon (delicious) and rice balls (also great). I tried the white lasagna special that had zucchini and truffles on top. It was amazing!!!! Wish I had a bigger stomach so I could eat the whole thing! Definitely would recommend",
    "category": "uncategorized"
  },
  {
    "text": "If you are looking for true Italian food you can’t go wrong with Piccola cucina.\nEvery time I go is a new experience.\nI order the special red shrimp carpaccio that is going to be soon in the menú and it was simply amazing.\nThe ceviche was even better than last time they always use fresh ingredients, porción are perfect, atmosphere, music, good wine, clean restaurant and staff friendly and professional.\nCan’t wait to come back",
    "category": "uncategorized"
  },
  {
    "text": "Here you can have the best PASTA 🍝 you have always dreamed of !! Cozy and amazing place for both lunch and dinner!!!",
    "category": "uncategorized"
  },
  {
    "text": "Piccola is my favorite Italian restaurant in NYC. They offer authentic Sicilian food with a great ambiance. Always prompt service, affordable, pasta dishes are to die for, never ate grilled octopus or ribbon zucchini better than here. I usually celebrate my birthdays in this restaurant, and it never disappointed me!",
    "category": "uncategorized"
  },
  {
    "text": "One of the coziest Sicilian places I have ever seen outside Italy! The food is excellent and the staff tu is super friendly! If you want to eat well and have a great time this is the perfect spot in the city!",
    "category": "uncategorized"
  },
  {
    "text": "Best authentic Italian food. I’ve been coming here for 3 years now and it’s the first place I recommend to anyone who wants a true Italian experience in NYC. This place is literally amazing.",
    "category": "uncategorized"
  },
  {
    "text": "BEST RESTAURANT IN THE CITY IF NOT THE WORLD. Bar none. Fresh, homemade pasta. Recipes straight from Sicily. Authentic, cozy, unpretentious vibe. I recommend this place to everyone I know and am here at least once a month. It would not be New York without Piccola Cucina!",
    "category": "uncategorized"
  },
  {
    "text": "If there is one Italian restaurant to visit when you land in NYC it is Piccola Cucina estiatorio. The food, the staff, the ambiance- everything is absolute perfection. When I go I feel like I am at an authentic Italian restaurant- which is true! The staff are mostly all from Sicily and a lot of their ingredients are imported and made in house. The quality is unmatched and the staff are truly the best type of people. The chef is also extremely talented and famous. Highly reccomend. Get the fennel salad, the lentil salad, bronzino, eggplant parm, penne Arrabiata, and pesto pasta. Also definitely make room for dessert. Their canolies are the best in the city no joke.\n\nI also had my birthday here and it was the best birthday celebration I’ve ever had. The restaurant played the best music and everyone got up to dance. Saturday nights at piccola cucina are where it’s at.",
    "category": "uncategorized"
  },
  {
    "text": "Amazing spot. Food is great. They have an amazing pasta selection and so far i’ve tried them all. The pasta alla norma is my favorite and the people who work there are super friendly.",
    "category": "uncategorized"
  },
  {
    "text": "We were positively surprised by the food and service here. As an appetizer, we ordered octopus, which was one of the best I've ever had. The fish of the day was also very good. and to finish, a lemon cheese cake dessert that was excellent. The place is a little tight, , but the excellent service makes up for it.",
    "category": "uncategorized"
  },
  {
    "text": "We had a delicious meal at this tiny restaurant in SoHo! Cinzia was our server and she was absolutely lovely. The pasta is fresh and al dente and do not pass on the gigantic pile of prociutto with fresh burrata. Heavenly! Beautiful wine list too. Definitely recommend.",
    "category": "uncategorized"
  },
  {
    "text": "The food was AMAZING. I’ve lived here for five years and just found this spot- wish I found it sooner. All the servers were so kind. And the pasta was unbelievable. Lovely apps as well. Can’t wait to come back.",
    "category": "uncategorized"
  },
  {
    "text": "The dishes are very delicious. Especially the octopus and the lobster linguine. Our server, Cinza, is very attentive, friendly, and give awesome recommendations.",
    "category": "uncategorized"
  },
  {
    "text": "The food is really delicious especially the lobster pasta. And our waitress Cinthya was really nice. Will come back next time!",
    "category": "uncategorized"
  },
  {
    "text": "We went on a Tuesday night and had a reservation - which was a good thing, it was packed! Prices were typical for NY but the portions were substantial so that was good. My friend and I were both interested in the ossobuco ravioli. We both ordered it and had no regrets. It was an exceptional dish and both plates were cleared. definitely recommend piccola for a hearty and very very tasty italian meal.",
    "category": "uncategorized"
  },
  {
    "text": "great spot for authentic Italian food. Arancini to die for.\nIncredibly creamy Cacio e Pepe. Succulent ossobuco ravioli.\n\nCinzia was so sweet, pleasant and outgoing.\n\nplace is tight. Had a couple practically making out across table from each other. get a room. Hostess tried squeezing multiple parties next to us and place was empty at this time.",
    "category": "uncategorized"
  },
  {
    "text": "Terrible staff and especially the waiter who was almost to fight with me when I gave order to his friend instead of him, hate the place and staff",
    "category": "uncategorized"
  },
  {
    "text": "Truly authentic Italian located in the heart of Manhattan. Fantastic food, excellent wine & accommodating staff. A true must visit when in NYC.",
    "category": "uncategorized"
  },
  {
    "text": "This is a small, boisterous, Italian restaurant. I would definitely make a reservation. The food was very good but unfortunately, due to the size of the restaurant, and the line up outside of people waiting to get in, you feel like you are being rushed.\nThe busboy continually walked by eyeing our table trying to take away any plate, glass, utensil that he thought we had finished with. This is definitely not a place you go to have a nice, relaxing dinner. Your are in and you are out.\nWe had a reservation for 6:30 and we had to wait outside for about 15 minutes to get a table. When we left I said , \"thank you, have a good evening\" to the hostess. She was so busy that she did not even respond. Everyone was running around, very busy.",
    "category": "uncategorized"
  },
  {
    "text": "Excellent place! The food is delicious and the attention is super good, I highly recommend it if you want to have a good time and eat tasty!",
    "category": "uncategorized"
  },
  {
    "text": "Outstanding food in a charming cosy setting. We had a quick lunch and it was excellent. Bruschetta, calamari and croquettes. All were terrific. We would readily come back whenever in NYC\n\nThe place was packed and I imagine it typically is. Best to call and reserve.",
    "category": "uncategorized"
  },
  {
    "text": "Service was slow and inattentive. Dishes came cold and tasteless. Lobster Luigini was smelling fishy …",
    "category": "uncategorized"
  },
  {
    "text": "5 star service and food was out of this world, really enjoyed the whole experience! Pasta was absolutely delicious you can really taste the quality and freshness as well as classical simplicity!",
    "category": "uncategorized"
  },
  {
    "text": "We arrived on a busy 8th of March evening for my wife’s birthday dinner, though we were a bit early the staff organized a table and their overall attitude to their job was impressive. The location is small and noisy but it creates the atmosphere of NYC, we expected the place to be like that.\nThe food was perfection. fritto misto was huge and fresh. penne al pomodoro and bucatini cacio e pepe were delicious.\n\nBonus: tutti parlano Italiano 👌🏻🤌🏻🇮🇹",
    "category": "uncategorized"
  },
  {
    "text": "We went here because the restaurant was ranked number one in New York but considering the ranking we were very disappointed. The food wasn’t bad but it wasn’t good either. Flavors weren’t balanced properly. We also felt rushed by the staff. This is certainly not the best restaurant in New York.",
    "category": "uncategorized"
  },
  {
    "text": "The pasta options were all delicious. We tried the Wild Boar, Eggplant and a Seafood pasta and all were very good. The Chicken Milanese with fingerling potatoes was also very good capped off with one tiramisu. All in all a good family Italian night and reasonably priced for NYC.",
    "category": "uncategorized"
  },
  {
    "text": "Great lunch specials here!! All of the pastas on the menu that had an * was on special. We went after the peak lunch hour on a weekday, so it wasn't too crowded. I'm sure it could get packed on peak hours because the tables are very close together.",
    "category": "uncategorized"
  },
  {
    "text": "Not the best Italian in NYC as some reviewers say, but it was very good. The appetizer was top notch, the entrees were good, and the cannoli was definitely A+. Wines were good and reasonably priced. I'd like to try it again and go with some of the more traditional dishes.",
    "category": "uncategorized"
  },
  {
    "text": "I had no clue! Read all the wonderful reviews and ended up in a crowded restaurant-everyone jammed in! Had to wait outside in the cold for 25 minutes for our reserved table. The music is so loud you feel like you are in a nightclub! No ambiance at all. You can’t even talk to the waiter the music is so loud. Food was ok but nothing special. I’ve eaten in many wonderful Italian restaurants all over the world! I would never recommend or go back.",
    "category": "uncategorized"
  },
  {
    "text": "But for is the experience wasnt as good as we hoped. We Made a reservation-but where put outside - had food very quick and 20 minutes later we left.. afterwards we even got an e-mail saying that we didn’t go so i answered we did..\n\nWe liked the good but we would have loved to be inside..",
    "category": "uncategorized"
  },
  {
    "text": "I've been to Piccola Cucina Estiatorio four times and found it truly wonderful every time. The food is astoundingly good and the service is efficient. The staff is a highlight - so helpful and they have quite a bit to cope with as this is a BUSY restaurant with a lot of people wanting a table. Book a table in advance and make sure you're booking the correct restaurant. They have a couple of nearby restaurants.",
    "category": "uncategorized"
  },
  {
    "text": "I’ve been here a few times already with different friends and family, and it’s always been an excellent experience! The food is just delicious! Great service and atmosphere. As an Italian who lives in NY, I highly recommend this restaurant as one of the best and authentic Italian restaurants in the city.",
    "category": "uncategorized"
  },
  {
    "text": "This place is so amazing! The quality and service are top notch. My favorite Italian restaurant in all of NYC. The servers are so kind and the chef comes around to check often - he is very kind and passionate!",
    "category": "uncategorized"
  },
  {
    "text": "… Yes please! Service was impeccable, food was delicious. Yes reservations are required. My only one tiny complaint is that it was so hot inside for me, I should have worn a tank top 😂 Even though tables are super close to you, it doesn’t feel intrusive. It is very loud so your conversation can still somewhat be private. The artichoke appetizer was divine as well as whatever my sister got but I can’t remember ! It’s in my pic ;) Would definitely return and recommend.",
    "category": "uncategorized"
  },
  {
    "text": "The service, staff, and food are incredible and the atmosphere is lovely. Have been going for years a",
    "category": "uncategorized"
  },
  {
    "text": "I was ecstatic to enter this well regarded eatery. Visits are undoubtedly worthwhile for the food. We ate lasagna, cacio e pepe, and a Greek salad. Both delicious and filling. The only issue would be the loud music, which felt more like it belonged in a nightclub than a restaurant. The server was also excellent and I will go back.",
    "category": "uncategorized"
  },
  {
    "text": "One of my favorite restaurants in nyc. Food is delicious and staff is just the best. Highly recommended for any occasion! My go-to spot in Soho!",
    "category": "uncategorized"
  },
  {
    "text": "Piccola Cuccina is one of my favorite restaurants in NYC. Love all their locations. Great food and service.",
    "category": "uncategorized"
  },
  {
    "text": "This place is full of warmth, charm, and italian love. Food is amazing and this is our 3rd visit when we are in the Village and has become our favorite. Must go and plan accordingly in advance. You wont be disappointed, you'll meet new friends, and experience the authentic, fresh, deliciousness of Italy. Great for cold nights, cozy and warm! Amore!",
    "category": "uncategorized"
  },
  {
    "text": "My love story with this restaurant starts in NYC 4 years ago and since that time I've shot them all, even Ibiza and every time it was amazing! Chef Gioele is the top, a 100% Italian restaurant, it took such a place in the world! Go eat in this place!!!",
    "category": "uncategorized"
  },
  {
    "text": "Excellent food and vibe! The taste is really Italian, small and cute place for a date with your partner or friends. The chef and the staff are so friendly and welcoming. I will come back for sure!",
    "category": "uncategorized"
  },
  {
    "text": "We had a really good service. The octopus was great and soft, different from all the places I’ve tried in NY. 10/10 recommended",
    "category": "uncategorized"
  },
  {
    "text": "La Piccola Cucina is hands down my favorite restaurant. Every single dish is out of this world, especially the pasta dishes. My personal favorites are the lasagne and the pasta ala norma. I've never had a pasta before with such a perfect texture, and this is what sets this restaurant apart from all the others–in-house made pasta and done with expertise you can taste.\n\nI had the pleasure of meeting the head chef, Gioele La Rosa after the dish and even got to speak with him for a bit. This man is so passionate about what he does and you taste it in every single bite. I do not need to go to any other Italian restaurant as long as this one is around.",
    "category": "uncategorized"
  },
  {
    "text": "I've been coming here since it opened before I was going to their locations in Soho. The food\nand service is outstanding, the pastas are out of this world .\nThey have a nice outdoor seating area , and try their tiramisu .\nNever been disappointed .",
    "category": "uncategorized"
  },
  {
    "text": "We often visit the place to celebrate family and friends occasions. Last time we were there in October 2022 to greet a friend from abroad in NYC. The quality of food is always excellent, fresh, and delicious. That time we were nicely surprised with new staffed artichoke appetizer, highly recommend it. Also we had razor clams and calamarata pasta with branzino and almond. My regular favorite dish is fussily, it has amazing fish sauce I cannot resist. Go and try it!",
    "category": "uncategorized"
  },
  {
    "text": "The ambiance and the food are great. Quick and professional service. I definitely recommend the place both for a business lunch or a night out with friends.",
    "category": "uncategorized"
  },
  {
    "text": "I happened to drop by here and OMG I haven’t eaten such delicious food for a long time until now, at Piccola! The chef really knows what he is doing! One of my favorites from now on.",
    "category": "uncategorized"
  },
  {
    "text": "A simple cuisine with very good food, a must to try is the involtini di pesce spada they remember me of home, great atmosphere and staff very friendly.",
    "category": "uncategorized"
  },
  {
    "text": "bruh it was really good 😋😋 I got the octopus and pasta, it was delishhhhhhh, ragu I’m coming for you next time 😭💖",
    "category": "uncategorized"
  },
  {
    "text": "Excellent!! Small place but loved the atmosphere. And wish we could eat more! The wine, the bread, and the food were very impressive. I want to go back to have everything again, but I would like to try something else too. Thank you Gabriel for your hospitality. You’re the best! Hope I can see you next time too.:-)",
    "category": "uncategorized"
  },
  {
    "text": "Best Italian in the city, affordable yet really fresh and high quality pasta (better than Carbone and other scency restaurants) The staff and chef gioele are friendly and always make me feel welcome when I visit from LA!",
    "category": "uncategorized"
  },
  {
    "text": "I absolutely love this place!!! They have the best service, food, vibes and people. The food is to die for and everyone there makes it such an amazing experience. I would recommend anyone to go there. The chefs are truly top of the line! I already can’t wait to go back.",
    "category": "uncategorized"
  },
  {
    "text": "I’ve explored a lot of Italian spots in NYC and I have to say Piccola Cucina is by far one of my favorites that I keep coming back to time and time again. This authentic, unpretentious spot serves up some of the best Sicilian food and wine. The staff is friendly and always accommodating and the atmosphere is fun and lively. It’s perfect for any type of evening from casual dinners and dates to celebrations and work events. I absolutely love this place.",
    "category": "uncategorized"
  },
  {
    "text": "Me and my friends had really good at the restaurant! Highly recommend 10/10! Hope to be back very soon!",
    "category": "uncategorized"
  },
  {
    "text": "The fish was soo tasty and fresh that I couldn’t stop eating until I almost get stuck in the chair . Great experience, great restaurant, great chef and team .",
    "category": "uncategorized"
  },
  {
    "text": "This is by far my favorite restaurant in all of New York City. They make the most amazing food with fresh, high quality ingredients and the plating is always so gorgeous. Their pastas are the best that I've had and are always cooked perfectly al dente. All of their seafood dishes are delicious- especially the crudo. I have yet to have fresher seafood at an Italian restaurant. The desserts are incredible as well. The staff is super friendly and the ambiance of the restaurant is so cute and fun. You really feel like you're in Italy. Chef Gioele always created the most amazing specials and makes sure the dining experience is top notch. I bring all of my friends and family here whenever people visit and everyone has loved it every time. You MUST try Piccola Cucina Estiatorio! Make sure to book your reservation well in advance :)",
    "category": "uncategorized"
  },
  {
    "text": "If you want amazing food and an amazing time, this is the place. From good food to good wine to a good time.",
    "category": "uncategorized"
  },
  {
    "text": "This is the best Italian you can eat in New York City. I’ve been eating at piccola cucina almost everyday of my last 4 years in New York and I can say that is like eating at my grandma’s.\nThe staff is the best and always very warm!\nHighly recommend it!",
    "category": "uncategorized"
  },
  {
    "text": "This place is always good food and good vibes! I am obsessed with their pastas! All the servers are fun and it feels like Italy. WARNING you must reserve ahead of time, otherwise you would be disppointed because this place is poppin’",
    "category": "uncategorized"
  },
  {
    "text": "Loved the pasta, loved the fish ! Great service, cannot go wrong ! it is real Sicily in Manhattan!!!",
    "category": "uncategorized"
  },
  {
    "text": "Amazing spot for authentic Italian food and great vibe! Chef and staff are super nice and welcoming, and prices are honest too. Don’t miss it !!!!",
    "category": "uncategorized"
  },
  {
    "text": "this is my favorite italian restaurant in NYC! i am from italy and know immediately when the food is authentic or not. and this one 100% is! whenever i visit piccola cucina, i feel like i am transported back home thanks to the welcoming service and to the delicious food. almost my most recommended spot for New Yorkers and anyone who is visiting!",
    "category": "uncategorized"
  },
  {
    "text": "The Beas restaurant ✅food good nice service the chef top cocineros top comida top pasta la mejor de New York",
    "category": "uncategorized"
  },
  {
    "text": "We had dinner with friends and tried out bunch of different pasta on the menu. Everything was so delicious with fresh ingredients! Chef Gioele was super friendly and helpful on explaining the menu. I’ll definitely come again!",
    "category": "uncategorized"
  },
  {
    "text": "I’m italian and I’ve been living in NY for a while now and Piccola Cucina is the only thing that truly brings me bavk to ny grandma’s kitchen!\nEverything has that perfect and authentic italian vibe, the staff is very friendly and always make you feel welcomed.\nGioele, the chef is the most talented and passionate person I had the privilege to being cooked for. You can feel the love for Italy and for the food itself at every bite!\nThe restaurant is very cozy and you can experience the “piccola cucina” kinda vibe.\nAuthentic Italian products, great selection of wines, amazing desserts.\nDefinitely so worth of every penny and even more!\nHands down the best Italian restaurant in NYC! 💖",
    "category": "uncategorized"
  },
  {
    "text": "Every time I’m in the city can’t wait to visit this restaurant because is my favorite ever! I’m Sicilian and this is like a travel back home where my mom is cooking, I don’t need to say nothing else… Highly suggested",
    "category": "uncategorized"
  },
  {
    "text": "Great place for a traditional Sicilian lunch or dinner. Food is quintessential from the region and reasonably priced. The Polpo Caprese was to die for. The staff makes you feel like part of a family. A must when in New York!",
    "category": "uncategorized"
  },
  {
    "text": "Excellent experience in this Restaurant ... from quality of the products to the courtesy of the staff ... a special thanks to chef Joele!!!",
    "category": "uncategorized"
  },
  {
    "text": "The cutest Italian spot with amazing food. The Chef truly cares about your experience. Everything we tasted melted in other mouths. Absolutely the best Italian food I had.",
    "category": "uncategorized"
  },
  {
    "text": "As a huge fan of Italy I’ve been at almost every Italian in NYC, and Piccola Cucina is my favorite. The atmosphere and energy feels like Italy. I recommend to order their bestseller octopus. Ofc pasta-absolutely delicious! And you should try ALL desert menu-you won’t regret!",
    "category": "uncategorized"
  },
  {
    "text": "Excellent location and friendly and joyful environment. My wife and I stop by this place everytime we come to NY. Food is fresh, authentic from Italy. My wife a fish plate and it was superb. I recommend cacio and pepe… top. Cannoli are like in Sicily, delicious. Definitely one of the best Italian restaurants in the city.",
    "category": "uncategorized"
  },
  {
    "text": "I visited with a friend and the vibe was cozy and romantic. The seafood tasted fresh and the pasta tasted of quality ingredients. The hostess, manager, chef, and support staff were all so kind and professional. The prices were reasonable for the quality of food, and the wine selection was great. I highly recommend going to anyone visiting NY and I definitely will be going back.",
    "category": "uncategorized"
  },
  {
    "text": "Fantastic Sicilian restaurant in Soho. Lovely friendly staff, amazing food and wonderful atmosphere. So good we booked to come back for our last night in New York. Just wish we’d found it earlier in the week. Highly recommended",
    "category": "uncategorized"
  },
  {
    "text": "I love this place. Incredibly delicious food, very cool atmosphere and friendly staff. Recommend to anyone who likes Italian food and wants to have a good time.",
    "category": "uncategorized"
  },
  {
    "text": "My favorite italian in the city since I tried years ago. I’ve been there many many times and has always been great. The stuff is fun and friendly, the environment is so cool and the food… AMAZING! It’s a MUST if you love italian food.",
    "category": "uncategorized"
  },
  {
    "text": "First time went to this restaurant for a dinner around a year ago with my friend. I lived in Italy when I was a kid, and in general love GOOD Italian food (and actually can say when it’s good😉). I was amazed! The taste, the presentation, the food, design in the restaurant (especially l’ape Piaggio inside!!!) everything was fantastic!! Excellent service! And you have to try their cannoli, extremely delicious!\nI love to take my friends out there! It’s just perfect🥰 Definitely recommend you to visit Piccola Cucina!!",
    "category": "uncategorized"
  },
  {
    "text": "Piccola cucina never disappoints! I have been a handful of times from a friend’s recommendation and truly have not had better Italian food. We love going for special events like birthdays or just with a big group of friends. The vibes are great, good music, and phenomenal food - my favorite is the cacio e pepe. Highly recommend and always my go-to restaurant!!",
    "category": "uncategorized"
  },
  {
    "text": "If you’re looking for high quality food with reasonable price, this is the spot. They have an authentic Sicilian variety of pastas and seafood but without a doubt their wine selection and creative specials are the most outstanding points.",
    "category": "uncategorized"
  },
  {
    "text": "I come here very often here with my friends we really love the vibes here and the foods thanks to the Italian guys here the ambiance is amazing!",
    "category": "uncategorized"
  },
  {
    "text": "This place is Our second home far from home. Me and my husband continue to come here to eat almost every week, here we enjoy the best food and company in the city. Especially the waiters makes you fell like their best friends, can’t change it with nowhere else. Sometimes the chef got inspired by Us and create a special dissert out of nowhere (just for me! 😍) will continue to come and come always ⭐️⭐️⭐️⭐️⭐️",
    "category": "uncategorized"
  },
  {
    "text": "Went there first time last week, and was amazed with the food the make there. Like I was sent back to Italy, right to Sicily with every bite. Service was impeccable, prices were reasonable and wine was delicious. I definitely will be back! It’s a gem!",
    "category": "uncategorized"
  },
  {
    "text": "Amazing food and great atmosphere. It seems to be in Italy. The staff is friendly and the lunch menu is affordable and excellent choices. Definitely worth a visit.",
    "category": "uncategorized"
  },
  {
    "text": "I highly recommend Piccola Cucina not only for Italian food lovers. I have tried many things on their menu and everything has always been delicious!",
    "category": "uncategorized"
  },
  {
    "text": "I’ve had a really good experience having dinner there.\nThe food was really good and mostly fresh.\nI got pasta with sword fish and tomato sauce and my friend ordered maccheroni alla norma.\nBoth excellent tbh.\nThe place really magical, with good music and really comfortable seats.\nThe stuff amazing and also very kind!\nI highly recommend it for Italian-cuisine lovers!❤️",
    "category": "uncategorized"
  },
  {
    "text": "Amazing food, delicious pasta (including gluten free pasta option), excellent desserts (cannoli absolutely to try). Exceptional staff and last but not least very nice location.",
    "category": "uncategorized"
  },
  {
    "text": "It was my first time dining at Piccola Cucina Estiatorio and it was a great experience. The staff was very attentive and friendly. The food we got was some of the best Italian food I’ve had in NYC, couldn’t have asked for better pasta. Everything is fresh and flavorful.\nChef Gioele was great and made my first visit even more special. I highly recommend!",
    "category": "uncategorized"
  },
  {
    "text": "I’ve been coming here with friend so many time that I cannot count them, the pasta is so huge and amazingly tasty that you can die desiring it!",
    "category": "uncategorized"
  },
  {
    "text": "Me and my friend found this spot for accident but was the yummiest accident ever!!! I never tried such amazingpastas at this price in Nyc",
    "category": "uncategorized"
  },
  {
    "text": "My wife liked this restaurant amd especially the food of this restaurant and she is very picky about it so if you like to eat go this is a must go. Try the special of the day or any suggestions they will give you",
    "category": "uncategorized"
  },
  {
    "text": "Sometimes you dont know where to go to eat and dont feel bad next day? This is the spot, they have one of the best pasta worldwide, also the portions are huge and you cannot be disappointed. We absolutely loved here, thank you",
    "category": "uncategorized"
  },
  {
    "text": "I live and work not far from this restaurant, they serve very good appetisers but even better pasta and what to say about the dessert? Simply yummy! I always crave them when i think of Piccola Cucina! Italian warranty... made in Sicily",
    "category": "uncategorized"
  },
  {
    "text": "This is your place to go whenever you want to eat good! They have two restaurants one on the corner of the other one and they have probably the best italian food of the city",
    "category": "uncategorized"
  },
  {
    "text": "Even though sometimes it’s tough to get a reservation there, it’s always worth it! I love to eat there, food is fantastic, service is attentive and atmosphere is very welcoming. I highly recommend to run there, don’t walk!",
    "category": "uncategorized"
  },
  {
    "text": "I have been here several times and it never disappoints. They definitely make the best pasta in town, wine list is great as well, service is exceptional. I highly recommend to visit when you are in New York City!",
    "category": "uncategorized"
  },
  {
    "text": "Highly recommend!!! I am a regular at piccola cucina - the food is incredible and the best Italian food I've had in NYC. And the staff is so friendly! Gioele is an amazing chef and every one of his dishes is perfect. Never a disappointment at piccola!!!",
    "category": "uncategorized"
  },
  {
    "text": "The food is so great! I went there on my birthday. The experience was great. Have to try lobster linguine!",
    "category": "uncategorized"
  },
  {
    "text": "There are just three things to know about this restaurant:\n1- the food is fantastic, simply Italian best\n2-the service will make you feel like home with friends,\n3-you’ll keep coming and coming and will be not able to stop. The price for the aerea and the amount of good food you’ll be served is ridiculously cheap!\nP.s. From Monday to Friday until 4pm the prices are half!!",
    "category": "uncategorized"
  },
  {
    "text": "I always come here whenever I crave pasta! Is like take a flight direct to Sicily and eat to grandma house… simply amazing! ❤️ Suggested for anyone that wants a real Italian good and service.",
    "category": "uncategorized"
  },
  {
    "text": "Everyone has a favorite place, mine is Piccola Cucina Estiatorio! I always eat super well!! The food is insanely delicious and authentic - every time it makes me feel at home thanks to the chef Gioele and the great service! You’ll love it!",
    "category": "uncategorized"
  },
  {
    "text": "Piccola cucina is the best Italian restaurant in nyc. The food is delicious and tastes the same as in Italy. The staff is very friendly and always happy. It’s always a pleasure to eat at this restaurant!",
    "category": "uncategorized"
  },
  {
    "text": "My wife and I have been here many times, she is from Sicily and so she has very strong opinions when it comes to the quality and authenticity of “Italian” food in New York. This place is hands down our favorite, I have never ordered anything off the menu that I didn’t love. The best cannoli I’ve ever had in my life, so don’t skip dessert",
    "category": "uncategorized"
  },
  {
    "text": "This is my go to for Italian food in New York, a high honor! Everything I’ve tried has been absolutely delicious. The food is so well prepared and authentic. Real quality Italian—a must try next time you’re in the mood. Save room for desert! It’s always the cherry on top of a perfect meal here.",
    "category": "uncategorized"
  },
  {
    "text": "Cannot rave about the food and experience at Piccolo Cucina Estiatorio enough! By far the best Italian (and Sicilian) food in the city. Atmosphere transports you to a small town in Sicily where grandma is in the kitchen and everyone is family that eats there. Thank you to Gioele for the absolutely best food and making us feel right at home.\n\nTutto era delizioso- la prossima volta porteremo più persone perche stasera avremmo potuto sfamare un esercito! Grazie mille nostro amico.",
    "category": "uncategorized"
  },
  {
    "text": "Hands down the best restaurant in the City. A perfect equilibrium of flavors from starters to dessert. You can tell from the first bite that products are genuine and quality superior. Better than many restaurants in Italy (trust me, I’m Italian).\n\nNot only the food is delicious, but also the atmosphere is warm and the staff very welcoming and fun. If you have the chance, have a talk with Chef Gioele: he is a true master of the Italian cuisine and a very nice person.",
    "category": "uncategorized"
  },
  {
    "text": "This restaurant is my go to place in the city.\n\nThe first time I went to Piccola Cucina Estiatorio it was during the pandemic and I felt in love with this spot since then.\nNot only I was very impressed by the nice atmosphere but especially by the great food.\nItalians are very picky when it comes to food, we know, and I have to say that Piccola Cucina made me felt like I’d never left Italy.\n\nI go pretty often to Piccola Cucina Estiatorio and every time I’m always very torn because I’d eat all the menu!\nThey have the best raw fish you could find.\nCarpaccio and tartare are absolutely my fav dishes. Therefore, their pasta is a master, each pasta you have on the menu is delicious and mouthwatering !\n\nThe last but not the least, get their tiramisu! They prepare it right in front of view and it’s terrific.\n\nIt’s always a pleasure to go to Piccola Cucina also because the chef and the staff are always very nice and they can recommend you very well. They are a great team I just wanna thanks them for doing such a great job and for making expats feel home!\n\nTrust me, this place is amazing ❤️",
    "category": "water"
  },
  {
    "text": "Amazing food and vibes! Chef Gioele La Rosa is so passionate about making sure his food is of the highest quality and satisfies the tastebuds of every person who dines at Piccola Cucina.\n\nIt’s one of my favorite restaurants in SoHo. I highly recommend making a reservation and giving this place a visit!",
    "category": "uncategorized"
  },
  {
    "text": "Every time I go I have a fantastic time. The food is incredible and still holds my favorite pasta in the city the fusilloni langoustine!!! Everyone that works there is a gem. It’s always my go-to when friends or family is visiting me.",
    "category": "uncategorized"
  },
  {
    "text": "As a Sicilian woman,I feel I can say this restaurant is definitely the most authentic Sicilian restaurant in the city. First of all the place it’s very cozy and warm and the food it’s delicious, it’s always my first choice when I m in the city and I want to eat Sicilian food!",
    "category": "uncategorized"
  },
  {
    "text": "As an Italian living in NYC, this is the only Italian restaurant I enjoy going to. Fantastic food quality and traditional but with a sophisticated modern take. Great work from Gioele and Team!",
    "category": "uncategorized"
  },
  {
    "text": "Always love coming back to Piccola Cuccina! Best Italian food with a modern touch served by the most wonderful team and in such a great environment. Can’t recommend it more!!",
    "category": "uncategorized"
  },
  {
    "text": "Went most recently for a friend’s birthday but I’ve been to every location and it’s consistently good although the atmosphere is definitely the most vibrant at the soho location. Everything is so delicious from the apps to the pastas! Love how many options there are and haven’t been let down with anything I’ve tried. Favourite was the rigatoni pesto with lobster ragu 🤤",
    "category": "uncategorized"
  },
  {
    "text": "Piccola Cuccina has the best pasta out of Italy 🇮🇹 Great prices, excellent service and an amazing atmosphere! My place to go for Italian cuisine!",
    "category": "uncategorized"
  },
  {
    "text": "I love this place ! Honestly for any type of occasion, very friendly for kids and families, amazing food and outstanding service. I come here religiously every two weeks even more often if I can ! Definitely 5 stars for everything!!!",
    "category": "uncategorized"
  },
  {
    "text": "One of the best Italian restaurants in NYC ! I come to eat here often. They are always wonderful with their hospitality, service, and freshness and taste of food. I love you Piccola Cucina !",
    "category": "uncategorized"
  },
  {
    "text": "The authentic Italian food in NYC. The pasta was incredible, particularly the handmade ravioli filled with ossobuco! The chef and the staff are very cool. The wine selections was interesting, with a lot of choice among small and big wineyards all around Italy",
    "category": "uncategorized"
  },
  {
    "text": "Recommended by a friend and it did not disappoint. Great service and great food. We had an amazing time!",
    "category": "uncategorized"
  },
  {
    "text": "Best restaurant in NYC. we’ve been coming here for years and it’s spectacular every time! We love the chefs, hosts and everyone in between!",
    "category": "uncategorized"
  },
  {
    "text": "Showed up for our 730pm reservation on time. Patiently waited outside in a chilly wind tunnel for 25 minutes with no follow-up. Entered to get an update and encountered zero empathy. Was seated about 5 minutes later. The crowd has deteriorated from cheerful locals to obnoxious tourists. We decided to leave. It’s too bad the food and service used to be great we’ve visited this location many times over the past decade or more. Very disappointing experience.",
    "category": "uncategorized"
  },
  {
    "text": "The best pasta and fish in NY 😍 I love eating there not only for the dishes but also for the atmosphere created by Chef Gioele and his team❤️",
    "category": "uncategorized"
  },
  {
    "text": "My daughter took us here on our last night in NYC. What a treat! We didn’t have a reservation but they could accommodate us. The restaurant is cute and quaint. The service was great. The food was delicious. We got the grilled calamari and I thinks it’s the best Calamari I’ve ever had. We ordered two pastas and a salmon tartar. Everything was delicious. The rigatoni with pesto and lobster melted in your mouth. But what was especially nice was one of our party could not eat dairy and the staff went out of their way to ensure that his dish was dairy free.\nAnd last but not least, their wine list was awesome.\nHighly recommend. Will definitely go back when we’re in town.",
    "category": "uncategorized"
  },
  {
    "text": "We stumbled upon this restaurant walking in Soho and this was the best Italian meal I have had in Manhattan. My seafood pasta was wonderful. The desserts homemade and just a fantastic meal. The restaurants directly surrounding this one were begging us to come in. I was worried that they were not busy. We had to wait 30 minutes for a table here. Now I know why.",
    "category": "uncategorized"
  },
  {
    "text": "Excellent service! Excellent wine, excellent pasta!! It was so Delicious!! We will come back for sure! An incontournable!",
    "category": "uncategorized"
  },
  {
    "text": "Dissappointed, my meal wasn't hot and I had to send it back. My husband's meal was bland and dry, nothing like the previous time The rest of the family weren't impressed either....just no care went into preparation and/or they are just reheating cooked food. Sad they have gone downhill, won't be going back. Too many other great places to try.",
    "category": "uncategorized"
  },
  {
    "text": "I am really picky when it comes to Italian food. This place is really good, cozy, friendly staff, and very good food. We had Maccheroni alla Norma and Bucatini cacio e pepe con tartufo nero. Can't wait to visit again.",
    "category": "uncategorized"
  },
  {
    "text": "Piccola Cucina my top choice for Italian in NYC. I am a local and it is absolutely my go-to. The pasta is the best you can get (imo) and tastes like it was literally made in Italy. Every time. The staff is all absolutely lovely too as well as the ambience. Highly recommend!!!!!",
    "category": "uncategorized"
  },
  {
    "text": "Piccola Cucina is my go to restaurant whenever i'm in NYC. The food is delicious, the staff is great and never looses its authenticity. Also a great place to go on a cute date!",
    "category": "uncategorized"
  },
  {
    "text": "I visited this restaurant for dinner with a friend and we had a lovely experience. The food was delicious, the waiters friendly, and the ambience and decor perfectly complemented the evening. Expect to discover the essence of Sicilia in the heart of New York. Would definitely visit again when I come back to the city.",
    "category": "uncategorized"
  },
  {
    "text": "Was very excited to get into this highly rated restaurant. The food is definitely worth the visit. We had a Greek salad, cacio e pepe and lasagna. So filling and delicious. Only complaint would be the music was very loud and gave a nightclub vibe not a restaurant. Server was also fantastic and will return.",
    "category": "uncategorized"
  },
  {
    "text": "Went here when visiting NYC with my mum. We had a fantastic meal! We shared bruschetta to start then each had lasagna. It was the most fantastic meal. The service was also absolutely delightful. I couldn't recommend this place enough but make sure you book!!",
    "category": "uncategorized"
  },
  {
    "text": "A perfectly NY tiny and tight Italian - fish forward restaurant. A little outdoor space gave a few extra tables. Almost impossible to get a reservation but keep trying it is worth it. Extensive pasta selection. A tad hard to find low cal - low carb options but it’s ok to splurge",
    "category": "uncategorized"
  },
  {
    "text": "This is one of the best meals I’ve ever eaten in my life! And we’ve eaten all over the world.\nI had the lasagna which was different than any lasagna I have ever had before, but it was so divine I almost cried when it was all gone.\nMy husband had the Bucatini Cacio e pepe. They cook the bucatini (thicker than spaghetti) and then put the cooked pasta in a massive block of cacio cheese until the pasta melts cheese onto the noodles. Then they scoop out the pasta and melted cheese and put fresh cracked pepper on it.\nThe entire restaurant stopped and watched while it was happening because it was absolutely fascinating.\nI absolutely will eat here every time we come back to New York! It is a small quaint place with a chef straight from Sicily Italy.",
    "category": "uncategorized"
  },
  {
    "text": "Trip Advisor recommendation. Fabulous authentic Italian, great vibrant atmosphere, very popular. Small so I would recommend booking in advance. Great service, friendly staff. Food was excellent.",
    "category": "uncategorized"
  },
  {
    "text": "Wow! I would give this six stars if I could. Nice quaint Italian restaurant in the SOHO district. The bruschetta was the best I’ve had since dining in Italy 11 years ago. I had the Bucatini pasta with the cacio cheese and pepper. They brought out a giant block of cheese to the table then proceeded to melt the cheese with the pasta, then added the black pepper. It was delicious! My wife had the lasagna and it was hands down the best lasagna I’ve ever tasted. Not sure how anyone could give this restaurant anything but five stars- it was amazing!!!",
    "category": "uncategorized"
  },
  {
    "text": "Small scale and fairly intimate. Great food, great interior, great service and a great atmosphere. Busy, so reserve if you can or go early like we did. We would readily return.",
    "category": "uncategorized"
  },
  {
    "text": "What distinguishes this typical village-style restaurant from others? Their servers are all from Italy, maybe even from Sicily. This young team makes your stay a true experience, supported by above-average quality food.",
    "category": "uncategorized"
  },
  {
    "text": "Yesterday ive been here with friends and I’ve never experienced anything like that in NY… food is exceptional we tried couple of different appetiser and a few different pastas.\n\nOur server Marco made us feel at home by explaining the menu in details, and suggested specials we all loved. he did an extremely good job by taking care of us at all time even tho he was extremely busy, over all probably the best service we experienced in NY. Will come back 100%",
    "category": "uncategorized"
  },
  {
    "text": "Very good food and service !The ambient was very nice. I felt like I was in Italy, the food taste very Italian and fresh. Extremely recommend the lobster Soaguetti.",
    "category": "uncategorized"
  },
  {
    "text": "Me and my friends came here after a long day of shopping. We didn’t have a reservation but they seated us right away! We ordered the bruchetta, Cacio e Pepe, and the tagliatelle. Everything was great! Our waiter Marco was super attentive and friendly. We will be back!",
    "category": "uncategorized"
  },
  {
    "text": "I went there in October during the week, service was great and the vibe was amazing.I ordered Calamarata with seabass and almonds it was delicious. All my friends were very happy with their order too. Will definitely go back!",
    "category": "uncategorized"
  },
  {
    "text": "I’m a frequent visitor and I absolutely love the place. The food is always fresh, the menu changes by the season to incorporate fresh seasonal vegetables/fruits and they have daily specials. All ingredients are exported from Italy. The servers are very attentive and make sure your glass is always full! If you are looking for real Italian dining experience this is THE place to go!!! Pictured are fusilli with langoustine scampi with Burrata and rigatoni with pesto and octopus for main course and salmon tartare cannoli as appetizer special. Absolutely all pastas on the menu are delicious, just pick one and you won’t be disappointed!!!",
    "category": "governance"
  },
  {
    "text": "Great Italian atmosphere with very delicious food. You must try their eggplant appetizer, any pasta will be a winner and for desert, strongly recommend connolly.",
    "category": "uncategorized"
  },
  {
    "text": "I have been always coming back to this place. Lovely atmosphere, absolutely delicious food and great wine! Thank you for all the staff, that is working hard to make your guests happy and a little addicted.",
    "category": "uncategorized"
  },
  {
    "text": "It's been a long time coming that I write this review. I've been coming here about once/twice a month now and just can't get enough of the... well... EVERYTHING. The food is spectacular and reminds me of when I travelled to Sicily. The service? Impeccable - they make you feel like you're part of their family. And the atmosphere is warm and comfortable.\n\nMy girlfriend and I love starting the night with the octopus caprese and grilled calamari. As for mains, I'm obsessed with the Bucatini cacio e pepe. Overall, I highly recommend paying this place a visit over and over and over!",
    "category": "uncategorized"
  },
  {
    "text": "I am a big fan of this little cute restaurant. The pasta is just amazingly delicious plus service is impeccable. Prices are reasonable too. If you are looking to get some Italian dinner, it is a place to be.",
    "category": "uncategorized"
  },
  {
    "text": "Absolutely delicious food and a beautiful scene! Best authentic Italian food in the city! I love this spot.",
    "category": "uncategorized"
  },
  {
    "text": "My favorite Italian spot in NYC! The tagliatelle with wild boar is to die for and the service is warm and hospitable.",
    "category": "uncategorized"
  },
  {
    "text": "I ordered the Lasagna della Mamma Rosa and it was so tasteful 🤤🤤 The waiters and the chef are really nice and Marco gave us great menu suggestions! Thank you, Marco!",
    "category": "uncategorized"
  },
  {
    "text": "The food is spectacular! The best Italian food that I have ever ate in the US. Guile is a great chef! I had the arancini, melanzane a parmigiana and tagliatele con ragu. Other than that, the service is perfect! Marco was very kind and efficient! I highly recommend it and I will definitely come back to try all the other dishes! Thank you :)",
    "category": "uncategorized"
  },
  {
    "text": "Great place and food! Really good service! A small part of Italy in NYC (; I totally recomend this restaurant!",
    "category": "uncategorized"
  },
  {
    "text": "I love Italian food so I decided to try Piccola Cucina and it was a great experience! I love fish so this time I chose fish dishes and obviously Cannoli, but I’ll come back for sure to try everything!! The staff is also very kind and friendly and the location very nice!",
    "category": "uncategorized"
  },
  {
    "text": "Super nice place at a beautiful neighborhood. I strongly recommend the lunch deal, amazing food for a prize difficult to beat in Manhattan!",
    "category": "uncategorized"
  },
  {
    "text": "Top food, top service, and fantastic price-quality/quantity with the lunch deal. I would strongly recommend It!",
    "category": "uncategorized"
  },
  {
    "text": "Super friendly staff, quick service even if the restaurant was packed, delicious and abundant food. Everything felt so authentic from the ambiance to each carefully-prepared dish. Two Italian expats who tend to be picky. This felt like being back home!",
    "category": "uncategorized"
  },
  {
    "text": "I went to have dinner in Piccola Cucina Estiatorio with my Italian friend on a Friday night the food was just amazing, we had Branzino and Fusilloni with scampi, the location is super cute and the stuff is kind and friendly! We’ll come back for sure!",
    "category": "uncategorized"
  },
  {
    "text": "Made a reservation to dine with a friend. As soon as we got there they sat us right away. Staff is very nice and friendly. Food and wine are great. Authentic Italian experience. Highly recommend! We'll come back for sure!!!",
    "category": "uncategorized"
  },
  {
    "text": "I was today in a very important meeting with my partners this restaurant is the best NEW YORK the richest food all Super spectacular and incredibly Piccla Cucina stars💯👍",
    "category": "uncategorized"
  },
  {
    "text": "The food was super good and thé portion very big. Service is very good too as They help a lot to chose from thé menu. Best italian in Soho.",
    "category": "uncategorized"
  },
  {
    "text": "just visited this place in soho after a friend recommended it.\n\nfood is amazing as an italian i must say this is way better and authentic that any other place in NY…\n\nportion are huge and service is incredibly ready to help you out.\n\nnever been in a better place in yet.",
    "category": "uncategorized"
  },
  {
    "text": "Very authentic Italian food in the heart of Soho. The service and the treatment are probably the best I ever had in NY the food if incredibly tasty and the portion are very generous for NY standard. Will come back 100%",
    "category": "uncategorized"
  },
  {
    "text": "The most wonderful meal with even better service! I am Italian and approve of this authentic meal 100%!!! GO NOW!!",
    "category": "uncategorized"
  },
  {
    "text": "Had a fabulous dinner at Piccola Cucina Estatorio. Have been to Enoteca & Osteria as well. The staff is amazing and the food is out of the world. I get the cot octopus caprese and pasta with mushrooms every time. Always a wonderful experience when I come! Highly recommend!",
    "category": "uncategorized"
  },
  {
    "text": "Piccola Cucina was absolutely delicious! We have been waiting to try their delicious pasta for over a year and it did not disappoint! Request to be at Diego’s table - super fun! We will be back very soon!",
    "category": "uncategorized"
  },
  {
    "text": "Amazing experience with the most amazing staff.!! I had my bachelorette party here with all my friends and we had the most amazing service and the best food",
    "category": "uncategorized"
  },
  {
    "text": "Fun, knowledgeable staff and my favorite cacio e pepe in the city. Everything is so fresh but so fast. It’s a slam dunk for a great, fun meal.",
    "category": "uncategorized"
  },
  {
    "text": "First of all service from all the staff was extraordinary at all times. The food from antipasti to main course as always fabulous. Strongly recommend the prosciutto with burrata and the scampi fusilli, also the Italian beer was great!",
    "category": "uncategorized"
  },
  {
    "text": "I have spent amazing time in there. Amazing food amazing service. I have had Chianti wine and cacio and pepe pasta. I've loved them. Super suggested",
    "category": "uncategorized"
  },
  {
    "text": "As a Sicilian, I could feel the authenticity of this place as soon as I walked in. It’s so cozy and feels like home. The portion sizes are huge and the rice balls are the best I’ve ever had! A+",
    "category": "uncategorized"
  },
  {
    "text": "Went there with a couple of friends last night, service was tremendously good and food was ridiculously amazing. We took few starters (octopus, riceballs, meatball) and than a main each my pasta with lobster was unbelievably tasty and portion are very generous. Would definitely put Piccola cucina estiatorio in my favorite spot list.",
    "category": "uncategorized"
  },
  {
    "text": "Visited NY from Los Angeles earlier this month. On Oct 14, local friends took us here. We had a great time and loved everything about it. Then on our last night in NY, we had LA friends visiting so we took them. A special night. Misha the maître d, recognized us from the prior week and was engaging, gracious, and looked after us very well. Food-spectacular; wine-had never had Sicilian wine and he directed us to a couple of bottles which we loved; service-impeccable! And, Marco did a good job, too!\nHighly recommended!!",
    "category": "uncategorized"
  },
  {
    "text": "We came here for our first night's dinner on a recent trip to NYC. While the food was good, the pasta was well cooked, and the service was adequate - there were just too many people crammed into this small restaurant. We sat a two-top right next to the large open window to the front patio, after sidling in between tightly crammed tables and encouraging the table next to us to remove their purses from our seats and hold them on their laps. The small space was made a bit more uncomfortable by having very large format menus. If the physical size of the menu is greater than the distance between tables - it makes things extra challenging. In addition, the poor staff had to try to get in and around the restaurant with essentially no extra space at the serving stations, making things rough to avoid a bit of jostling.\n\nI'd prefer to come back on a quiet night (if there is such a thing) to avoid feeling so close to everyone.",
    "category": "uncategorized"
  },
  {
    "text": "We came on a Tuesday night and there was a line up so make sure to make reservations! No cocktails available at this restaurant but we did order some beers to start. We were able to bring our own wine for a corkage fee. We shared the rice balls, wild boar meatballs and lobster/guac and burrata/mush bruschetta-all excellent! For our mains we ordered the lasagna(which my husband raved about), mussel/linguine special and the grilled branzino, which were wonderful! I asked the server if they could debone the fish for me, which he replied they could not. When the fish arrived, it had been deboned! So happy! My daughter’s Milanese chicken was really tasty but it was huge and could have easily fed two people. The desserts were yummy too. Because the restaurants is small and so busy, it felt a little rushed at times(and a tad on the hot side)but we understand the need to turn tables over. The service was very attentive despite the restaurant being packed. I highly recommend!",
    "category": "uncategorized"
  },
  {
    "text": "So ... the restaurant on Spring Street didn't bother to notify me they were closed. We ended up being routed to this sister restaurant. The menu item we wanted (pasta with sea urchin) was offered but in a different version. Good, but not what we wanted. No bread is served. Shocking! They have a lunch special menu that was not mentioned and I just happened to order it. Small serving, but tasty. Crowded with table spacing way too close. We've just started going back out again but the pandemic still points to spacing further apart. All in all -- too expensive and small portions. And not serving bread is disappointing. The freebie cannoli were delicious. But overall -- I won't return.",
    "category": "uncategorized"
  },
  {
    "text": "Even my Sicilian-American parents would have been impressed with the food and wine. Our family gathering was served delicious appetizers of rice balls, crispy calamari and eggplant Parmesan among others. The homemade lamb, osso bucco raviolis were to die for. Dessert was an amazing cannoli consisting of a fresh, crunchy shell and sweet, creamy filling. The wait staff couldn't have been more accommodating and courteous despite how busy it was. Can't say enough about the experience. If I could give more than five stars, I would!",
    "category": "uncategorized"
  },
  {
    "text": "This place can not even get salad correct. All the food was terrible. The place is loud, waiting staffs also have loud voices to the point of nearly defeaning you. Expensive!",
    "category": "uncategorized"
  },
  {
    "text": "Seafood pasta with shrimps and cheese was incredible. The antipasti of eggplant was tasty. Desserts were delicious. Ambience is nice and staff are very attentive and welcoming! Definitely a must visit if you are in town.",
    "category": "uncategorized"
  },
  {
    "text": "The food is delicious. I love Italian food and this was beyond my expectations. The calamari and octopus both very fresh and generous and the pasta to die for. Generous food and lovely setting. The outdoor space is very nice. I understand why it is so high in TripAdvisor ratings",
    "category": "uncategorized"
  },
  {
    "text": "Delicious food and wonderful atmosphere! We sat outside and it was very nice. Everything we ate was delicious - burrata, arancini, octopus salad, seafood pasta, branzino (cooked perfectly!) and a side of vegetables (tasted just like Italy). Benedetta made an amazing Aperol Spritz and then when I ordered another, showed me how to make it (Grazie, Benedetta!). The cannoli are also excellent. The waiters are Italian and are very nice. As someone who lived in Italy extensively, I am picky about Italian food. Look forward to coming back for many more meals.",
    "category": "uncategorized"
  },
  {
    "text": "Thank you for the amazing dinner ! Everything taste GREAT and Italian . I have eaten the best of my life ! And the arancini was soooo YAMMY ! I’ll be back as soon as possible for your fresh fish market! Thank you guys!",
    "category": "uncategorized"
  },
  {
    "text": "Visited New York for business and a co-worker was pleading that we eat Italian...and I found this establishment via some exceptional reviews. This is a quaint restaurant, rather small, but large in character. Having toured Italy, I would characterize Piccola Cucina as extremely authentic. Our server was from Sicily, the server waiting the table next to us from Rome. The wine list was 100% Italian, the most extensive, comprehensive list of offerings that I have ever seen outside of Rome, Tuscany or the Amalfi Coast. Dinner was amazing. We both feasted on the Burrata con pomodorini e basilico and Ravioli stuffed with ricotta in a mixed mushroom sauce featuring sausage meatballs. The restaurant offers a solid selection of seafood options! I will note that the restaurant was packed and people never stopped trying to get in. Looks like reservations are a must for this charming, delicious eatery...that will for an hour or so make you feel as though you are on the Italian coast. Highly, highly recommend!",
    "category": "uncategorized"
  },
  {
    "text": "One of our favorite places in New York. Always delicious. Always busy. Always friendly. this night was great as usual. The Gamberi Caprese - very interesting. Bucatini Cachio Pepe - sublime. Spaghetti Neri Lobster - a feast for the palate and the eyes. The Verdure Grigliate and Patae Limone rounded out the fare. looking forward to out next adventure at Piccola Cucina.",
    "category": "uncategorized"
  },
  {
    "text": "We reserved at the last minute via 'open table' and when we arrived we were seated fairly quickly. The service was good for this very small and crowded restaurant, and very noisy. As for the food, it seems that Sicilian cooking can be tailored for American tastes : in other words taking the tastes out of most of the tasty ingredients starting with the complimentary sun-dried tomato and caper purée. The sea food pasta plates were over salted and bathed in sauce as if to compensate the lack of taste from the starters and making tasting the pasta impossible. In general the place lacks subtlety.",
    "category": "uncategorized"
  },
  {
    "text": "Everything is good. The food, the ambiance, the service and the location. The burrata and the octopus are specially good.",
    "category": "uncategorized"
  },
  {
    "text": "Food amazing, staff superb and atmosphere the best. Restaurant small but creates a unique experience.",
    "category": "uncategorized"
  },
  {
    "text": "You’ll feel like you’re in Italy! Treat yourself to dinner here the food is delicious! Reasonable prices too!",
    "category": "uncategorized"
  },
  {
    "text": "We visited this little Italian gem on Christmas Eve. Great food and service. We had ravioli, truffles pasta and pasta with lobster. All great dishes accompanied with very nice Italian wine made our evening perfect. Also, the atmosphere and interior is great. If you like an Italian experience in NYC this is the place to go!",
    "category": "uncategorized"
  },
  {
    "text": "Tiny but wonderful Italian restaurant with homemade pasta and great energy. The staff was so kind and enjoyable",
    "category": "uncategorized"
  },
  {
    "text": "Piccola Cucina Estiatorio is perhaps New York’s most dedicated to the culinary spirit of Sicilian cuisine, now that Eolo in Chelsea has been closed down. I loved the Paccheri alla Carbonara, and the coffee with cannoli was a great cap on the night.",
    "category": "uncategorized"
  },
  {
    "text": "We tumbled across the restaurant on a Saturday afternoon during our NY holiday and absolutely fell in love with the place. We were lucky to get a table without booking as the restaurant got quite busy shortly after. The food was very fresh and absolutely delicious and all the waiters extremely attentive. At least half of the guests were from Italy which is always a good sign to find authentic Italian cuisine. We came back on our last evening because we enjoyed it so much - highly recommend!",
    "category": "uncategorized"
  },
  {
    "text": "The Hostess was so nice to find us a table, even though we didn't have a reservation (and from what we saw, the place was very busy). The attention was great, and the food was DE-LI-CIOUS. We're both from Perú, which is THE destination to eat delicious food at fair prices, and we both agreed that Piccola Cucina could EASILY compete with any of the top restaurants back home, the prices were more than fair, and the food was amazing; will recommend to any friends/family coming to NYC.",
    "category": "uncategorized"
  },
  {
    "text": "So many young Italian speakers in this restaurant. All friends and all having so much fun. Food and vibe were incredible and authentic.",
    "category": "uncategorized"
  },
  {
    "text": "Scrumptious pasta dishes with a focus on seafood and super friendly service make this place a great choice for dinner in the Village. Our sever was attentive and friendly. The environment was small and intimate and, though tables are close, the lively atmosphere made for a friendly room with a great vibe. We had a really good time and would easily recommend it both for the food and the experience. They have a full compliment of beer and wine, but no liquor license for cocktails, which I mention only because a good nigroni would fit the great food. Go and enjoy, this place hit the spot!!!",
    "category": "uncategorized"
  },
  {
    "text": "Nice small cozy place. Tucked away in soho. Busy vibe loud ambience and great food. The staff is overly friendly & welcoming a bonus in my book.",
    "category": "uncategorized"
  },
  {
    "text": "Had pasta cacio pepe and a slice of pasticcio Just fantastic. And the final coffee woth sicilian cannoli was a dream come true",
    "category": "uncategorized"
  },
  {
    "text": "It was a busy Sunday night, but I was able to get a table in the corner. This restaurant is one of 3 within a few blocks of each other. All Piccola Cucina, each with a different ending. I ordered cavetelli with meat sauce and wild fennel. Interestingly, it was served in the pan in which it was cooked. Large portion; adding grated cheese made it even tastier. I could barely finish it. At $18, it was reasonably priced A Peroni beer was the appropriate drink. With the front opened, it's like outside seating.",
    "category": "uncategorized"
  },
  {
    "text": "You know it’s a good start when everyone in the restaurant is from Sicily, from waiters to cooks! The food is fresh and clearly lovingly prepared, and you just feel good eating it and after you’ve eaten it. It’s a place you want to hang out out and come back to. Top-notch! So hi to Carmello!",
    "category": "uncategorized"
  },
  {
    "text": "We visited on a very rainy night in NYC, but totally worth it!! Started with the Grilled Sardines and Octopus which were perfectly done. Main courses were Pasta Norma (a Sicilian traditional dish) and Pasta Fruti di Mar. The pasta was perfectly cooked and sauce beautiful. We have been to Sicily twice and this restaurant's food reminded us of those trips. The place is a little noisy, but creates the warm atmosphere for this great Italian Food. We will be back!!",
    "category": "uncategorized"
  },
  {
    "text": "After reading the reviews I had high expectations. The wine recommendations were excellent but the waiter was a bit pushy recommending too much food! We had a seafood/veggie combo appetizer and the Sicilian rice balls. Be prepared for fish and shrimp complete with heads and eyes. My sister did not like her grilled seafood plate, it looked a little too fresh from the sea. The pastas were good but a bit too al dente. Super loud once it fills up, can't really have a conversation. Next time I'll try somewhere else. Cute little place and Spring Street is a fun area for strolling.",
    "category": "uncategorized"
  },
  {
    "text": "Amazing food and great wines. A lovely Sicilian corner. A special thanks to Emanuele that helped us with our choice and a perfect wine pairing.",
    "category": "uncategorized"
  },
  {
    "text": "My partner recently had a big birthday and we celebrated it by visiting New York, with friends flying in from Paris, France; California and Dallas, Texas to celebrate it with us - so it was really important I got the restaurant for the birthday dinner right. I chose the Piccola Cucina Estiatorio because of the excellent reviews on TripAdvisor. The restaurant fully lived up to them. The food was delicious, the service was amazing and the atmosphere was fantastic. I can't recommend this place highly enough if you want a place with great food, great service and a great atmosphere. It was perfect for my partner who likes good food and service but can't stand the pretension of overly-posh restaurants. We were a party of nine and were looked after brilliantly, from the helpful person who took my call to book the table (thank you Maria) to the wonderful staff in the restaurant who made us feel so welcome. Thank you all for making it a fantastic evening which we will remember fondly for a long time.",
    "category": "uncategorized"
  },
  {
    "text": "I thought I’d had the best pasta in Italy but Piccolo Cucina managed to beat all expectations!\n\nWe had 3 pastas: the tagliatelle with octopus ragu, the meat ragu, and Bucatini cacio e pepe.\n\nThe tagliatelle with octopus ragu was a complete showstopper! The other two dishes were also delicious.\n\nThe service was perfect, and the ambiance was good - relaxed and casual but it still felt special.\n\nI can’t wait for my next trip to New York just so I can come back here!",
    "category": "uncategorized"
  },
  {
    "text": "Following friend suggestion we had dinner in this amazing place. After several days of junk food all around US we completely recharged our batteries with delicious Italian plates. The place is small but very nice and the waiters very kind. Pasta was delicious, very well cooked and the meet and sword fish were top quality. Strongly suggested to whom looking for very good Italian food and trendy place.",
    "category": "uncategorized"
  },
  {
    "text": "Good selections in the menu Nice atmosphere Super kitchen and delicious Warm and quick service Tables are very close Guests age 25-45, relatively young atmosphere",
    "category": "uncategorized"
  },
  {
    "text": "The best Pasta alla Norma I have ever had in my life! I'm from Sicily, living in NY now, I'm very picky with food... and I'm in love with Piccola Cucina Estiatorio. Emanuele and all the team are great, very professional and always with a warm smile that makes you feel at home. Sicilian wine list with some gems (drink local, always) the food is amazing, fresh, tasty, perfectly cooked and also the Tiramisù and Cannoli alla ricotta as a dessert are perfect to complete your \"Italian escape\" in NYC. Can't wait to go back!\nps: Team, the phrase on the wall \"cucinare è un atto d'amore\" is not from Carlo Cracco but its from \"Enzo Bianchi\" from the beautiful book \"il pane di ieri\". Ciao!",
    "category": "uncategorized"
  },
  {
    "text": "We ate here on a Thursday night at opening (5:30). Nice and quiet for the first half hour until the restaurant got more crowded. Host did a great job spacing customers apart as much as possible until it got busier.\nService was fantastic and very attentive without hovering.\nEach course was served promptly but did not feel rushed.\nBurrata cheese with cherry tomato and arugula appetizer was the freshest cheese I've had a restaurant - seasoned perfectly with lovely presentation.\nI had the squid ink spaghetti with scampi langoustine and squash blossoms - the pasta was fresh and cooked perfectly with a velvety smooth and rich sauce. Definitely one of the best pasta dishes I've had!\nDessert was very good - cannoli had perfectly crisp and flavorful shells with a delectable filling. The custard in the tiramisu and creme brulee was smooth, rich, and flavorful.\nI would highly recommend this restaurant - try to come early because it is cramped and when it fills up, you have no elbow room.\nCost is a bit pricey, but not bad for quality of food and service and location!!",
    "category": "uncategorized"
  },
  {
    "text": "This is rated in the top 50 NYC restaurants. It’s good but is it in the top 50? The place is tiny so tables are very close together. This leaves little room for the staff to get by, which can be unnerving as hot pans are coming right at you. The noise level might exceed safe levels so don’t plan on a romantic conversation. The food is good but you won’t be blown away. The lobster and pasta was okay but the half lobster tail was dry and just sitting on top of the pasta. The service is fine and fun topped by asking our waitress for the dessert menu to which she responded, “The dessert menu is me!”",
    "category": "uncategorized"
  },
  {
    "text": "Visited this restaurant for our last night in NYC (it was a Monday) having read the reviews and expecting the very best Italian food.\n\nCan’t help feeling a bit disappointed with our experience to be perfectly honest because it really didn’t live up to the reviews and I think maybe we were really unlucky.\n\nWe had made a reservation and when we turned up at the restaurant there was a couple just in front of us who had arrived without a reservation. Without asking us first, the guy on the door showed them straight to a table and when he then came back to welcome us, we then had to wait for about 10 minutes while he found a table (clearly he hadn’t checked the reservations before seating the other couple and/or had given our table away).\n\nNo apology, pretty inattentive service - having experienced amazing customer service in NYC, this guy definitely wasn’t someone I’d have put in charge of arrivals!\n\nWhen we were seated, there was barely any room at the tiny tables. The restaurant was very busy so consequently it was incredibly noisy and while I know this contributes to atmosphere, it was impossible to have a quiet conversation (not least because the other tables were so so close!).\n\nFood was good, but honestly I wasn’t blown away - I’ve definitely had better Italian food elsewhere in NYC and in Glasgow and London.\n\nWe had the duetto bruschetta to start with burrata, porcini and truffle and guacamole and lobster. It was nice, although the truffle was overpowering and I personally am not particularly convinced by the pairing of guacamole and lobster.\n\nThen we had the Bucantini cacio e pepe with truffle and a special ravioli dish with seafood sauce and mussels.\n\nCacio e Pepe is my all time favourite Italian dish. I’m afraid I wasn’t blown away by this one. The pasta was a little more than al dente and the truffle sauce overpowered the simple cacio e pepe sauce too much.\n\nThe ravioli was filled with spinach and ricotta accompanying a very rich seafood sauce, it was nice but again a little heavy.\n\nWe had a very nice bottle of Primitivo, that was probably the highlight.\n\nGenerally the service wasn’t great - probably because it was so busy, but still. Twice in the hour we were there birthdays were announced with music so loud it could burst your ear drums - a tradition I don’t mind so much because it’s nice to make a fuss of someone on their bday but the music went on for so long, long after people had lost interest!\n\nI don’t like writing negative reviews because it is so difficult running and maintaining restaurants profitably and so all the positives should be celebrated. But this place is so highly rated I just wanted to provide some balance for travellers particularly because this wasn’t the outstanding quiet dinner I was expecting.",
    "category": "uncategorized"
  },
  {
    "text": "This small, cozy, authentic Italian restaurant specialized in seafood is our favorite place to eat in NYC. It exceeded our expectations. They have a wonderful Italian wine selection and a wide food menu with seasonal ingredients. We had a Plateau Royal and a bottle of Dom Perignon 2009 Vintage Brut. The food was beautifully presented and well-cooked. Friendly and prompt service.",
    "category": "uncategorized"
  },
  {
    "text": "We were so excited for our reservation and to see our big group of old friends. We were not disappointed. We sat at a long table and ordered endless food and drink. It was a small place that seemed very authentic. The bathroom was a small cozy room. The food was delicious. Everything. The waiter was super great. As the night went on and on, he pulled some of us who were dancers up to dance when a good song started! It was a hugely fun night.",
    "category": "uncategorized"
  },
  {
    "text": "Very nice Italian (Sicilian) restaurant. Atmosphere is very nice and relaxing with music that goes up time to time. Service is very good and friendly. Excellent food, just portions a bit too big. Reasonable prices.",
    "category": "uncategorized"
  },
  {
    "text": "We dined at Piccola Cucina Estiatorio this evening. It was like walking into someone’s home. It was warm & welcoming. The staff were very attentive. The food was amazing. I Would highly recommend this restaurant. Five stars!",
    "category": "uncategorized"
  },
  {
    "text": "Best service in town. Shoutout to my men, Carmelo, Jacomo, Costa and Emanuelle! Piccola Fridays would not be the same without you!! Thank you for always accomodating me and my guests.",
    "category": "uncategorized"
  },
  {
    "text": "I was asked to out to dine at this restaurant with 6 Italian's (4 of them from New York) so I thought that it was always going to be a fabulous meal and a good evening and it totally lived up to those expectations. This restaurant, like the name suggests, is a small kitchen, (with the 4 chef's busy within, which you can see clearly from the dining area). Whilst small they cram in a lot of guests, which ordinarily if in any other restaurant you would probably think (\"This is too cramped\") BUT at this restaurant it totally works and just adds to the amazing Italian party atmosphere that this place has, it really was fabulous and fun. The food was some of the best Italian I have ever eaten... The meatballs with mushroom and truffle to start was just divine and the ricotta ravioli with mushroom and pieces of sausage was also a dish that I didn't want to end. Prices are not too bad either with a feast of a dinner with a bottle of wine costing US$420 for 7 people. I finished sharing a traditional Sicilian dessert called a 'Cassata' with my friend (who is of Sicilian origins) and it was absolutely delicious... The perfect end to a perfect Italian evening in downtown Manhattan. I highly recommend this gem of a restaurant.",
    "category": "uncategorized"
  },
  {
    "text": "Love, love, loved this restaurant! Small, cosy, authentic and full of atmosphere! Had a real buzz about it! The food was delicious, very generous portions, service was great, but the ambience really makes this place! I would definitely recommend it!",
    "category": "uncategorized"
  },
  {
    "text": "If you crave good Italian pasta, this is the place to go. Most of the dishes are focused on seafood. The Lobster and truffle pastas are my favorite.\nThe cannolis are delicious.\nThe seats are very tight but you are getting really amazing food for the price. Very friendly waiters and festive atmosphere.",
    "category": "uncategorized"
  },
  {
    "text": "Great atmosphere, 100% authentic and passion through all staff. I would highly recommend this place to everyone! Grazie di cuore. ~Tony (dal Canada)",
    "category": "uncategorized"
  },
  {
    "text": "It’s small and crowded but that’s what makes it even more special. The wait staff works like a seamless team taking care of all patrons nonstop. It is like sitting at a family table in Italy and everyone is happy you are there! Food was delicious",
    "category": "uncategorized"
  },
  {
    "text": "Best Italian food in nyc I love this place and the food is really really good we will come back soon",
    "category": "uncategorized"
  },
  {
    "text": "This was a return visit and the anticipation was well-deserved. Every dish was a gastronomic experience to cherish. The Duetto Sandwich is hard to share but worth every morsel. Ravioli Funghi Salsiccia to die for. Cacio Pepe is a traditional Appulian dish done perfectly. Pachheri Seafood excellent. Patate Limoni and Verdure Grigliate great accompaniments. It is very noisy, but mostly from people talking and having a good time. Spontaneous dancing broke during our meal - just like dining in a local resto in southern Italy.",
    "category": "uncategorized"
  },
  {
    "text": "One of the best Italian seafood restaurant in the area , the food is a really fantastic here , the taste of pasta is unbeatable and the fish is very fresh , so looking for a nice place to spend some good time and have an excellent sea food , this is your place",
    "category": "uncategorized"
  },
  {
    "text": "If you love seafoodand and pasta this is the perfect place. They have 3 locations in manhattan and they are absolutely amazing.",
    "category": "uncategorized"
  },
  {
    "text": "nothing better for a birthday celebration then having a great meal...just delicious..........snapper cerviche.....grilled octopus......arancini (rice balls with meat inside). boccatini pasta with bolognese sauce and cannolis......where do i begin..??? cerviche light and fresh.....grilled octopus ..one of the best i have ever tasted and an ample serving ...arancini.. you could tell by looking at them how light they were and so flavorful....boccatini pasta cooked to perfection al dente style with a true bolognese sauce..and the best cannolis EVER....\n\na shout out to Andrea and his two associates who created culinary magic in their kitchen...bravo Andrea!!!!..... the place was packed and one can understand why...the food is so good.....service was also good..but the noise level might not be to everyone's liking.....so go with a group..or .if you like high energy or if as in my case you are celebrating a birthday which was recognized in the restaurant in grand style ...would definitely return.",
    "category": "uncategorized"
  },
  {
    "text": "Once again we tried the Cucina the night before and were excited to try this place because of the seafood dishes. The waiter was friendly and once again from Sicily. Refreshing to go to an ITalian restaurant with actual Italians working there. The wine recommendation was spot on for the meals we were having that night. The bread to start was amazing. The special that was lobster and bucatini I believe was great. The cavatelli dish I had with fennel was great.",
    "category": "uncategorized"
  },
  {
    "text": "More space more music and more choices great decor, the team is always smiling and happy, waiters sometimes lose overview of the customers but the food is always fresh fresh fresh GF pasta is available and the Ape chilling display makes you smile.\nPick any dish and you will enjoy it, authentic Sicilian flavor, priced well and good wine selection, Congratulations you found your SoHo restaurant experience",
    "category": "uncategorized"
  },
  {
    "text": "My NY cousins introduced my wife and I to this gem located in the Soho district. Just a small place open to the street, with a tiny kitchen. They specialize in Sicilian cuisine. All the cooks, servers etc.. were from Sicily. We shared a few appetizers; the best grilled calamari I’ve ever had, arancini, buffalo mozzarella. We all ordered pasta , each dish freshly made to perfection. We also shared a few desserts, cannolis, cassata, pane cotta.. The atmosphere was awesome. Traditional Italian music playing, the waiters dancing with some of the guests. Everyone there just had an amazing time. We will definitely return on our next trip.",
    "category": "uncategorized"
  },
  {
    "text": "This restaurant it will never finish to surprise me: simple, authentic, excellent!!! The seafood is super fresh, the atmosphere is great, staff friendly, genuine southern italian ( Sicily) food. Each time I come back here it s simply unique experience!!!\nGreat job Phi & Friends\nMari",
    "category": "uncategorized"
  },
  {
    "text": "Omg! I have been searching high and low for Italian food in New York on par with the Italian food I had when I visited Naples last year. Let’s just say that the search is over! I have found the place :) I had looked up restaurants through trip advisor and was impressed by this restaurants amazing reviews so I decided to check it out with my girls. The food is just out of this world amazing! Everything from the pasta to seafood is super fresh and super tasty. For the table we ordered the stuffed squid and rice balls which were super amazing and left me and my girls wanting more! For my main dish I had the cavatelli pasta. Words can’t even describe! One of my girls also had the cavatelli which she absolutely loved as well. Other entrees ordered were the branzino and the spaghetti with lobster. Everything was perfection and me and my girls were satisfied. The atmosphere was also perfect. Clientele was fun and youthful. Decor was super cute too! Service was also amazing! Our waiter Emanuele was so sweet and knowledgeable! He made us feel right at home and even took my girlfriend out to dance! We all had an amazing time and had so much fun! I will most certainly coming back!",
    "category": "uncategorized"
  },
  {
    "text": "This was such a find! Easy, fun, relaxed and good Sicilian food. The wine list is suitable to the price range and very good. The staff are friendly, the atmosphere a hoot and the food is really good. You will enjoy this. Make sure you book, it get every busy and it gets noisy. It's a fun and vibrant spot to eat.",
    "category": "uncategorized"
  },
  {
    "text": "In my opinion, this authentic Sicilian-Italian place, along with its two sister establishments in Soho, offer the best Italian cuisine in NYC. The ingredients are fresh, expertly prepared, and absolutely delicious. The service is extremely friendly and efficient. Furthermore, the prices are very competitive given the supreme quality of the food served.",
    "category": "uncategorized"
  },
  {
    "text": "We first went to their restaurant on Spring Street, which is very small & extremely noisy, so noisy we left and went around the corner to their, mainly, fish restaurant. I had the spagetti Nero with Langoustines and zucchini flowers. The sauce was lacking in flavour and was very peppery. They must have run out of zucchini flowers (already at 1:30pm) because there were none. My wife had the wild boar meatballs with porcini mushrooms and truffles. Both meals were okay, but not top notch Italian/Sicilian. They have very few Sicilian wines, and a lot of Tuscan / Piedmontese, which is probably understandable in the US. Sicily does have a lot of great wine producers so perhaps they aren't available here. They did have one Planeta rose, which is good, but for a popular choice Plumbago would be good. Work needs to be done in the kitchen & on the wine list, then perhaps they will live up to the name they created.",
    "category": "uncategorized"
  },
  {
    "text": "Never in US I found the same quality. Real real real Italian food. Cooked from real Italians. Family owned. Special friendship. I cannot find the correct words to say how I appreciate this restaurant and the guys that work there. SUPER!!!!!!!",
    "category": "uncategorized"
  },
  {
    "text": "This is a small restaurant in a little group of similar and nearby small restaurants. When one was too crowded for our party of 7, they sent us around the corner where they could accommodate us. The service was friendly and they got us fed and out fairly quickly for a table-service place so we could make it to a show. We had salads, pastas and tartare dishes, and everyone enjoyed the meal. It's easy to find top notch Italian food in the city, and this was one among equals. Not necessarily a standout, but very good, Recommend.",
    "category": "uncategorized"
  },
  {
    "text": "Just amazing. We had such a.good time. Dinner was very delicious. We will come back. The octopus stater was great! The pasta Norma and the pasta bucatini was great too! The ceasar salad amazing and the lamb chops so delicious. The cassata for dessert was amazing!!!! Love this place! Service very good too!!!! Will come back soon",
    "category": "uncategorized"
  },
  {
    "text": "The service at this small restaurant was excellent. Reservations are highly recommended, as the restaurant is small and, even on a mid-week evening, the place was full by 6:45pm. The atmosphere of the place is generally plain, on the dark side, but nice in its own way. My dinner consisted of three grilled prawns, which were fine but generally in the category of nothing special, and they came with lemon potatoes, which were quite odd to taste. My partner's meal consisted of mushroom ravioli, which he said was tasty, hearty, and earthy.\n\nPotential diners here should note one thing: The chef seems to have a special affinity for all things squid, and nearly one-half of the menu items and/or specials included squid or squid ink in one form or another. \"Your average place\" with \"your average menu\" this is NOT. If you like basic food, finding good menu options will be challenging here; if you like eclectic dining, Piccola Cucina Estiatorio may work out well for you.",
    "category": "uncategorized"
  },
  {
    "text": "This small restaurant, which has charming décor, plays the music at a deafening noise level. You cannot hold a conversation in this restaurant. It is by far the loudest restaurant that we have encountered in NYC.",
    "category": "uncategorized"
  },
  {
    "text": "The small venue on Thompson street was nice and cozy. I went on a date. It was loud, but they’re Italian so what do you expect. The menu was southern Italian. I’d order the grilled octopus and langostine squid ink pasta again. This is one of the few places that serves actual Italian food.",
    "category": "uncategorized"
  },
  {
    "text": "Much like its sister restaurant around the corner, this place is also an authentic Sicilian restaurant. A bit bigger than its sister but still crowded with a happy atmosphere. A loud music played in the background and everybody are happy. The food is fresh and tasteful and prices are very reasonable. Service was excellent. As pescatarians, we had many food choices. A vegetarian can also find starters and mains he or she can have.\nGreat place, highly recommended.",
    "category": "uncategorized"
  },
  {
    "text": "Great food and service. Front of restaurant open to street creating nice ambiance. Truly authentic food from Sicily seafood great. Small place so apparently owner had 3 similar small places in soho. We went to one on Thompson.",
    "category": "uncategorized"
  },
  {
    "text": "Business dinner with colleagues in Soho. Small space with great Sicilian food. Very nice Italian wine selections to pair. We loved the Arancini and grilled octopus apps. Pasta selections were fantastic!",
    "category": "uncategorized"
  },
  {
    "text": "Delicious Souther Italian Little spot in Soho...\nFood is delicious with the same flavor that you would get in Italy..\nPasta is al dente and the place bring you back to Italy with their music and amazing Italian Staff...\nIs not a turistic place is where locals go to have a great meal with friends and family.\nIs it quite popular so always full I suggest to make a reservation above all at night.\nEnjoy! Buon Appetito!",
    "category": "uncategorized"
  },
  {
    "text": "The restaurant is very welcoming, staff very courteous and pleasant, to this restaurant always exudes an air of gaiety and celebration. The fish always fresh, wonderful dishes in appearance and in flavors. I really recommend everyone to try this restaurant at least once! A dish that I highly recommend is the “duet of bruschetta with lobster, buttata and porcini mushrooms”. It’s very pleasant to find the restaurant with the real taste of Italy right here in NYC",
    "category": "uncategorized"
  },
  {
    "text": "Finding an authentic italian restaurant in NYC is not so easy (and no, Little Italy restaurants are not recommended), but Piccola Cucina is a real one. All the Chefs are directly from Sicily, the waiters are very nice and are helping you in having the best possible experience and atmosphere. They have different locations, this one is specialized in seafood, and it keeps up the expectations. The food is incredibly good and tasty; we have tried different seafood pastas, and all of them were great. Remember to leave some space for the dessert, sicilian cannolis is something you don't want to miss!",
    "category": "uncategorized"
  },
  {
    "text": "Amazing Italian food, fresh fish and great wine list. We recommend stuffed squid and lobster tagliolini. Great also the desserts. Staff is really friendly and prepared, a mention to Emanuele who made us spend a wonderful evening with his courtesy and sympathy!",
    "category": "uncategorized"
  },
  {
    "text": "On our last trip to NYC, we went to the Spring St location, so we tried this location. Delicious, too. We started with the grilled octopus--huge portion. We had 2 massive pasta dishes--raviolo and buccitini. Both fabulous, but we were unable to complete. Highly recommend.",
    "category": "uncategorized"
  },
  {
    "text": "The food was very good but not perfecto! Started out with the swordfish roll appetizer which unfortunately disappointed. The raisins and pignoli nuts were missing from the filling and it tasted dry. The grilled shrimp were fresh and delicious. Bread was outstanding but had to ask for it repeatedly before it was brought to us. Pasta dish was amazing and lamb chops very good. Servers need to try harder. This place can be exceptional. Like the casual vibe but music is too loud at times.",
    "category": "uncategorized"
  },
  {
    "text": "This is part of an expanding chain (or at least a collection) of restaurants and despite that it's not half bad. Fresh seafood is the hallmark of this branch and it's fresh and well done (grilled sardines are a good test). There are actual Sicilians in the kitchen as well as front of house, and their senses of humor are in evidence singing along with Italian pop numbers at times (don't panic, it's not singing waiter stuff, just rowdy youngsters). One of the closer approximations to a genuine Italian eatery you'll find in this part of the world.",
    "category": "uncategorized"
  },
  {
    "text": "Nice atmosphere and great service. I am Italian and I finally found the best pasta in New York City! Salmon and porcini was amazing! See you soon Piccola Cucina!",
    "category": "uncategorized"
  },
  {
    "text": "We went here because it was across the street from our hotel.The Sixty Hotel. This place just blew us away it was so good the next day we went to their sister place around the courner... The food was the best Italian we have had in NYC..I think this is young crew and they are making an effort...love it..",
    "category": "uncategorized"
  },
  {
    "text": "Great service and cheap price for the food quality. I had the bruschette with guac & lobster and burrata, porcini, truffle as appetizer, then the Bucatini cacio & pepe. Big portion and super delicious!",
    "category": "uncategorized"
  },
  {
    "text": "I recently had dinner at the new piccola cucina with some friends and everything was absolutely outstanding! As we shared a rich chef selection for appetizer, we tried the grilled octopus, swordfish rolls, grilled red prawns, a nice mix of raw fish and a fritto misto. It was just perfect!\n\nThe mix of grilled fish stakes and spaghetti with shrimp and scampi we shared for main was tasty and cooked properly.\n\nService was great and friendly, we all had a good time!",
    "category": "uncategorized"
  }
]